[
  {
    "url": "https://jackiebavaro.substack.com/p/vibe-coding-for-product-managers",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Vibe Coding for Product Managers - Day 1\nPMs, our time is now!\nJackie Bavaro\nAug 15, 2025\n15\n3\nShare\nHave you heard about vibe coding? It’s a way to create an app without writing any code, just by chatting with an AI. If you haven’t tried it yet, we’re going to change that today. I can get you started in 15 minutes, and if you want to build a real, useful web app, you can get that deployed in a few hours.\nVibe coding is a dream come true for product managers: all the skills we’ve built up working with engineers and designers are exactly what you need to work with an AI teammate.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nWhenever I try to learn something new, I find the hardest bit is the very very beginning of getting started. So, I’m recording step-by-step everything I’m doing to build a new vibe-coded ukulele practice app.\nI think it’s worth it to try vibe coding today even if you don’t have an app idea, so I start by asking ChatGPT to help me come up with an idea. If you’re stuck, think about your hobbies, anything you’re recording in a notes app, etc.\nThe only step I didn’t show is signing up for Replit: go to\nreplit.com\n, click sign up, I used my gmail account.\nDon’t want to watch the video?\nI don’t blame you, I prefer reading too, so here are the key points.\nChatGPT for Ideas\nHey I want to vibe code an app to help me, a total beginner, play the ukulele, can you help me brainstorm some ideas?\nIt gave me 6 ideas, and one of them was close enough to something I thought would be helpful - an app to help me practice switching between chords faster.\nNot shown in the video was that ChatGPT offered to make the app for me, I said yes, it scrolled an inscrutable amount of code on the screen and the resulting app didn’t work, at least because it couldn’t get microphone access. I’d meant to be using Replit anyway so I decided to shift gears.\nProduct Thinking - What to keep and what to unlearn\nAs a product minded person,  hold onto your core skills of picking a valuable problem and strategizing an impactful solution.\nIs there a real problem this app is going to solve?\nHow do you solve it today?\nWhat would it take for this solution to be 10x better?\nWhat tricky details does the app need to get right?\nBut, the cool thing about vibe coding is that trying out an idea is 100x cheaper than iterating with human engineers and designers.\nEarly in my career, I internalized that my key role as a PM was to make the most of valuable engineering time. I needed to get ahead of user needs, problems, and decisions so the engineers wouldn’t waste any time building the wrong thing. One of the worst things a PM could do was change their mind after the code was written.\nAI assisted coding flips this around. You can ask the AI to build something with almost no thought, and then when you don’t like the result, ask for a change, and then another change. This approach lets you try and react and can help surface those tricky details that need to be right a lot faster.\nThe two-pass approach to vibe coding\nWhat I’ve found is really helpful for getting the most out of vibe coding is to plan for a two-pass approach.\nThe first version of the app is just a scratch pad, a prototype that I intend to throw away. It’s going to be messy and that’s fine—the goal is to surface the big design questions and learn what you want the final product to look like.\nPS. That’s a real human-typed em-dash, I won’t let the AI have it.\nSo for the first pass, just don’t stress anything too hard. And take notes on what’s working or not working, since we’ll use that for our final pass.\nReplit\nHere’s what I typed in the Replit home page\nIt came up with a UI preview and a plan that I ignored and just clicked “Approve Plan & Start”\nIt worked for 6 minutes, during which I gave a little\ntour of the Replit UI\n.\nThe main thing to know is that in addition to the preview tab & agent tab, you can also see all the files it’s created and directly view or edit them.\nAlso a warning - AI agents (and all chatbots) are a bit like 5 year olds - they can just talk and talk and not know when they’re making stuff up. So don’t get caught up trying to teach it not to lie to you or to push it beyond its capabilities.\nHere’s an example of when that goes wrong\n. A big part of why I want you vibe coding a side project today is so that you start to get a real feel for what these platforms can and can’t do.\nFiling bug reports\nSo, in 6 minutes replit had a version of the app I could play with, and I immediately found problems. In fact with vibe coding, I find that the most useful skills are testing/QA skills - learning how to find and report bugs.\nIf you’ve gotten good at filing bug reports at work, with detailed repro steps and descriptions of what you expected vs. what happened, you’re in good shape to ask your AI agent to fix things.\nThe C major and F major chord illustrations don't look right. For example, C major is 3rd fret on A string, but the 4th fret is filled in, as well as 1st on G, C, and E. Can you please double check the fingers & frets for the chords and make sure the illustration matches\nThis worked to fix the inaccuracies, but the design was still terrible (fixed in day 2, coming soon!)\nJust 1 minute for the bug fix!\nAdding listening\nThe first version didn’t actually listen to me playing the ukulele to let me know if I was playing the right chord or not.\nIs it currently listening to see if I played the right chord?\nIt wasn’t and it asked if I wanted it added. “Yes please” I responded.\nHow long do you think it took to add listening and chord detection? To me this feels pretty complex. I’d expect an eng to tell me at least a day.\nReplit? 2 minutes. And it worked!\nWhat I found especially delightful was the way it talked to me about what it was doing as it worked:\nI'll add chord detection capabilities to the app using the Web Audio API. This will allow the app to listen to your ukulele and provide real-time feedback on whether you're playing the correct chords.\nNow let me create a component for chord detection feedback and integrate it into the practice session:\nNow I'll integrate the chord detection into the main practice page:\n…\nThis helps me build a little intuition of how it works and what’s involved in the change.\nCheckpoint / Rollback\nReplit automatically creates checkpoints. If I try something out and it doesn’t work, I can rollback to this checkpoint and undo.\nSome Reflection\nVibe coding is really fun, almost addictive.\nThere’s a whole lot of PM skills I use when vibe coding:\nThinking about goals and the problems I want to solve\nSetting design goals and constraints\nReviewing the product for bugs & design issues\nWriting clear bug reports\nUsing my own knowledge of what’s possible\nAnd there’s a lot that’s different\nThe cost to build new features and fix bugs is totally different than my previous expectations. I can’t assume what will be hard or easy, so I shouldn’t cut scope before I’ve tried.\nIt’s almost free to try different ideas, change my mind and iterate.\nThe apps can come up with good design ideas\nI’ve really enjoyed day 1. The writeup for Day 2 is coming soon!\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n15\n3\nShare\nDiscussion about this post\nComments\nRestacks\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:19:51.005961"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/cracking-the-behavioral-interview-putting-it-together-with-pearl",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Cracking the Behavioral Interview: Putting it together with PEARL\nProblem, Epiphany, Action, Result, Learning\nJackie Bavaro\nAug 05, 2025\n12\n3\nShare\nCracking the Behavioral Interview is now complete! The first article is optional, but reading the rest in order will set you up for success:\nBuild up your Interview Confidence with a Wins Warmup\n(Optional)\n\"Tell me a project you're proud of\" - 4 Mock Interviews\nWhat is the interviewer looking for?\nWhich project should I talk about?\nWhat makes a story impressive?\nWhat details should you include in your story?\nPutting it together with PEARL\nSo, you’ve done the hard part. You’ve chosen a high-stakes project where you personally drove success. You’ve remembered the impressive details.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nNow we just have to put it together into an engaging and easy-to-follow story. A little bit of structure will help you out.\nThere’s nothing wrong with using STAR (Situation, Task, Action, Result) if it’s working for you. But when you’re applying to senior roles in tech, STAR might lead you astray:\nThe story sounds like it is happening\nto\nyou, not something you’re driving. The situation existed and you fell into it.\nThe task appears out of nowhere and you need to deal with it. Did the manager tell you to take on the task? Maybe?\nThe comprehensive step-by-step list of actions goes on forever and feels like a waste of time.\nYou end negatively framed questions like “tell me about a failure” on a low point\nA lot of tech people have found that PEARL works a little better to tell impressive stories.\nPEARL\nPEARL stands for Problem, Epiphany, Action, Result, and Learning. Here’s how it works.\nProblem\nStart the story by framing up the problem. you’re going to teach the interviewer what they need to know about the product, customer, industry, etc, so that they care about the problem you went on to solve.\nOur job is to solve problems. Customer Problems, Business Problems, Design Problems, Technical Problems. These pain points matter, and I bet they’re something you feel strongly about. Your goal is to get the interviewer to care too.\nSome things to include\nQuick Intro and Starting Context details\n- you can reuse your company’s existing mission, strategy, etc. to get started\nThe problem, and how it ended up on your plate. What were you handed, and what did you notice yourself? Make it clear if you identified the problem.\nAn example that highlights the pain point\nIt’s okay for this part to get long. Your interviewer will enjoy learning about your industry and the bits of expertise that you’ve picked up along the way. They should feel emotionally invested in the problem and believe that it’s important to solve.\nEpiphany\nNext, you need to show your unique contribution. If you’ve\npicked an impressive story\n, then you weren’t just doing what anyone in your shoes would have done.\nThere’s some reason that you decided not to go with the flow\n, and that reason is the insight you had. What insight did you discover? How did you see it when others didn’t? That’s your epiphany.\nFor senior-level roles, the epiphany is key to the hiring decision. Once you’ve come up with your insight, the rest of your actions naturally follow.\nThis is a great place to bring in your principles, values, and other signs of your experience. Maybe your key insight came from your value of digging deep into the data. Or you’ve learned from experience to pay attention to surprising customer questions and follow up on them. Perhaps you’re always strategically looking for opportunities to integrate your product lines.\nThere’s\nmore examples of insights and epiphanies here\n.\nAction\nFor the story to make sense, you do need to touch on the work you did, but keep it brief.\nThis is were you talk about how you made it happen and what obstacles you overcame.\nYou don’t want to list out a bunch of obvious steps where you did what anyone would do. On the other hand, the interviewer might be looking for specific experience like A/B testing or AI prototyping that you should mention.\nKnowing what to include and what to skip takes a bit of awareness. Did the job description or company website list specific requirements? If so, include. Are you going from one well known company to another? If so don’t bore them with steps that they already assumed you followed.\nResult\nYou need to show that you’re results-oriented, so be sure to include the results. Strategically, how did it go? Tie this back to the original problem and goals.\nIt’s great to include numerical results when you have them, and even better to put those results in context. Was this the biggest adoption win your company had ever seen? Did it double your expansion revenue? Maybe these results were strong enough that leadership decided to double the investment in your team. Help the interviewer understand how good the results are.\nLearning (for growth stories):\nYour interview story should end on a positive note, and including what you learned lets you do that.\nGrowth questions\nare the ones that ask you about a time you messed up. If you took them at face value, you’d just talk about the negative results. But they’re really meant to surface how you’ve learned and grown.\nWhat was your assessment of what went wrong? What did you learn?\nAnd then, talk about a time you applied that learn. How did you do better next time?\nHowever, you don’t need to include learning on every story. If you’re applying for senior and director level roles, it can backfire if it looks like you’ve just learned new things in your recent projects. You want to\nshow that you’re past the learning stage\n, and into the “knows how” or “excels” stage.\nExamples\nHere’s how it all comes together.\nMoneyball\nHere’s “project I’m proud of,” inspired by the book\nMoneyball\n.\nI’d love to talk about how I turned around the Oakland As baseball team, sound good?\nWhen I first took over as General Manager of the Oakland A’s, we were one of the poorest teams in Major League Baseball.\nWhen you run a baseball team, one of your biggest levers for winning is the players you sign. Big teams like the Yankees and Red Sox could spend two to three times more than we could on salaries. They could sign superstar players and poach the talented players we developed. That cycle made it nearly impossible to sustain success, and we were expected to sink to the bottom of the standings.\n(Problem)\nBut, I realized that the way we were traditionally scouting players didn’t seem very predictive: the fastest runners and players with the best batting averages didn’t perform the best once they were on the team. There had to be a better way. So, I worked with my assistant GM who ran models and found out that on-base percentage was one of the most predictive stats for scoring runs, and it was deeply undervalued. I realized we could buy wins more cheaply than anyone else if we changed how we valued talent.\n(Epiphany)\nSo, I restructured our recruiting strategy, focusing on on-base percentage. We hired older guys with bad knees and hitters with awkward swings. As you might imagine, there was a lot of resistance from scouts, coaches, and ownership, if you want I can go into how I brought them over.\n(Action)\nWith this new approach, instead of collapsing in the standings as predicted, we won 103 games, tying the Yankees, and finishing first in our division. And we did it spending less than a third of the Yankees’ payroll. I’m really proud, not only of the division title win, but also because this approach was eventually adopted by the entire league and led to better baseball.\n(Result)\nNotice how most of the answer is spent explaining the Problem and Epiphany. We’ve let the interviewer know we can dig into the Action more if they want, but we’re not going there pre-emptively.\nCombining Projects\nSometimes you don’t have a perfect project to talk about. In those cases you can combine multiple projects into a larger theme.\nI’d love to talk about how I turned around some struggling teams at my company over the past year.\nSo, at my company we have about 20 product teams across 3 focus areas. Strategically it seemed like we were going after the right problems, but the teams were struggling to ship. Sometimes a team would spend months circling around dependencies and requirements, and it was taking a long time to get new products launched, which was affecting our revenue. This was considered the top company risk by the leadership team.\nThe head of product saw that my teams had shipped well, and so he asked me to join the dashboards team to run their next launch which was at-risk. When I joined I realized that things were being run in a very ad-hoc manner, and so engineers just weren’t clear on what they should be building and not driving towards small milestones.\n(Problem)\nSo for this first team, I just came in, listened to all the people on the team to understand their concerns, and put in place some basic best practices - 2 week sprints, prioritized backlogs, daily standups. We got the launch out on time, and the team’s morale improved a lot.\nI thought I’d go back to my original team, but the Head of Product then asked me to keep working on the next high-impact at-risk team. I found basically the same problems on that team, and I realized that the root problem was that teams lacked a repeatable playbook for execution. A lot of our PMs had been promoted internally and were learning on the job, so they sometimes missed things that were more obvious to me.\n(Epiphany)\nSo, I decided that in addition to helping these teams get back on track, I’d document the best practices and run a series of learning lunches to help other teams.\n(Action)\nSo, I’m really proud that over the year, I helped six projects get out the door and increased our revenue growth rate, but I’m also proud that I was able to improve our overall shipping culture. Today most of our teams use my playbook and we’ve stopped seeing our launch execution problems as a top company risk.\n(Result)\nSince none of our individual projects were that impressive, we’ve instead focused the answer on the repeatable process and organizational excellence.\nTo make this story work, the documentation and learning lunches were an important, but small step. If you’re in this situation today, see if there are similar ways that you can share your learnings with the rest of the company to uplevel your experience.\nGrowth Questions\nWhen we get asked about a failure, we’ll need to add on the Learning so that we can end on a positive note. Remember to pick a story that was foundational for one of your current strengths.\nHere’s one of my real examples from early in my career, although for an actual interview this was too long ago. I’ve got a more recent example in\nthis post\n.\nWhen I joined SharePoint full-time, one of the features I was assigned to own was RSS feeds, which had just been built over the summer by some interns. This was my first time taking over an in-progress feature, and my instinct was to respect the work & planning the previous people had done, and just finish up the remaining polish.\nSo you might not have heard of RSS feeds, but they’re basically the way the podcasts work today - any website can make a podcast, and any podcast app can subscribe to get new episodes. But, news reader apps didn’t have the “open in app” functionality yet, so websites would just put a link to the feed that you’d have to copy/paste. If you clicked on the link instead of copy/pasting it, by default you’d get a scary page of xml. We didn’t want to scare SharePoint users that way.\nLuckily, a few sites were already using stylesheets to make that scary page look like a normal web page. I knew some other teams at Microsoft used RSS, so I reached out on their mailing list to see if they had stylesheets we could use. I asked for one for RSS, and one for another format called Atom, since we were letting the user choose which format they wanted.\nI was totally shocked and embarrassed when I got a reply-all email berating me for having an Atom option when we should only have RSS.\n(Problem)\nAfter I got over the shock, I realized the other PM was right. I learned that the RSS vs. Atom debate was an internal standards debate between Microsoft and Google, and it had no end-user impact because all the news readers supported both.\n(Epiphany)\nI felt bad about undoing someone else’s work, but I removed the Atom option and added a stylesheet for RSS, which turned out fine for our customers.\n(Action+Result)\nWhat I really learned from this experience was that it’s my responsibility to become the expert in the features I own, even if I’m inheriting them from someone else or coming in near the end of a project. Now when I join a team I really dig into the past decisions and make sure I understand and agree with them. I’m still mindful of the balance of changing things and delaying a launch, but I’m willing to make changes if I believe they’re important for our customers or business and the timing matters.\n(Learning)\nThis one took a while to explain the problem, because the story wouldn’t make sense without it. I could probably get it a little shorter if I could get rid of my instinct to explain how things were different in the old days. But, I kept the action and result really short, because they’re not important to the story.\nI like this story because I think it illustrates my strengths and weaknesses fairly well: I get a little caught up in my emotions, but I also recognize it and have found ways to push through to get the right results. The interviewer really learns something about what it’s like to work with me.\nHow not to sound over-rehearsed\nWhen it comes to the interview, you don’t want to get disconnected from your story and end up in that awkward spot where your mouth is reciting words and your brain zones out. Trust me, I’ve been there.\nThere’s two approaches you can take:\nJot down just the keywords in bullet points, and then come up with the words you’ll say in the moment\nPractice, practice, practice, until you’ve rehearsed through the awkward stage and you really know your stuff so well it’s natural\nMany people love approach number one. I’ll be honest, it doesn’t work for me. I freeze if I just see keywords and I’ll still ramble. So, I get my interview stories to the same point of familiarity as my “How my husband and I met” story.\nYou probably have a similar story that you’ve told a million times, how you chose your college, what made you decide to go into technology, etc. Think about how you don’t use the exact same words every time you tell the story, but you probable hit the same beats in the same order. Once you get two of your interview stories to this point, the rest come a lot easier.\nConclusion\nThe hardest part of behavioral interviews is picking the experience you want to talk about and finding the impressive details. Once you have those, you just need a little structure to get your story across.\nIf the STAR format hasn’t been working for you, try out PEARL to keep your answer sounding high-impact and focused on your specific contributions.\nTo practice and to generate more examples, try out my custom GPT :\nPEARL Interview Coach\n.\nGood luck!\nIn case you missed them,\nCracking the Behavioral Interview, the complete series:\nBuild up your Interview Confidence with a Wins Warmup\n\"Tell me a project you're proud of\" - 4 Mock Interviews\nWhat is the interviewer looking for?\nWhich project should I talk about?\nWhat makes a story impressive?\nWhat details should you include in your story?\nPutting it together with PEARL\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n12\n3\nShare\nDiscussion about this post\nComments\nRestacks\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:19:52.233129"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/behavioral-interview-details-to-include",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Cracking the Behavioral Interview: What details should you include in your story?\nHow to be specific without rambling\nJackie Bavaro\nJul 31, 2025\n2\n1\nShare\nOne of the most common mistakes I see is people who are too vague, generic, or surface level.\nIt’s a much bigger problem than candidates who ramble on for too long, although I often see both at the same time: rambling about surface-level process.\nAs an interviewer, I can’t get any signal if you were good at your job when you tell me “I interviewed users to identify their top problems and then prototyped designs to get my solutions approved.” I assume that you’re just following the process that every PM at your company follows. The fact that you don’t realize this isn’t useful counts slightly against you.\nPhoto by\nGio Almonte\non\nUnsplash\nMore detailed answer still don’t always give me the\nsignals I’m looking for\n. “I built custom AI dashboards leading to 15% additional revenue” sounds promising. But, I’ve heard this story several times and sometimes this was a founder-led project where the candidate made very minor contributions.\nThe trick to sounding\nimpressive\nis to show how\nhard\nthe work actually was.\nYou need to include the right details. The ones that show the\ncomplexity\nof the problem and how\nyou specifically\ndrove good results.\nIt’s not easy to remember the juicy details of a past project, so here are some prompts to help you surface the good stuff:\nQuick intro to industry/company/team\nStarting context (so you can contrast what you did)\nYour insights & how you came up with them\nChoices/Options/Tradeoffs\nPushback, their reasons why, how you overcame\nYour strategy/values that played a role\nThe results, and the context they need to understand the results\nThese details will become the key content in your stories. Don’t worry too much about the format of your answers yet, it’s too early for that constraint. Let’s explore each of these areas.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nQuick Intro\nIf you want your interviewer to understand your story, you’re probably going to have to teach them a little bit about your company, industry, or team before you get into your story.\nGoals\n: It’s totally fine to re-use your company’s talking points on mission and strategy\nCustomers\n: Who are your customers, what are their problems, what’s different about them that the interviewer might not know\nHere’s a quick example\n“At Asana our mission is to help teams work together effortlessly. What’s unique about our target customer is that we really go after the reluctant project manager - maybe a marketing person who’s just been promoted and they realize they won’t be able to get their campaigns out without a bit of project management.”\nUse this as a chance to establish your expertise.\nStarting Context\nYou need to start your story by setting up the background context. You need to explain what things were like before you started, so that people can understand how you made a difference.\nThis bit corresponds to the “Situation” in STAR, or the “Problem” in the\nPEARL framework\n.\nTo understand why this is so important, you need to know a little bit about how managers assign projects.\nSometimes there’s a straight-forward, low-impact project that’s the perfect scope to hand to someone junior, eg. “Build CSV export.” These are easy for the interviewer to evaluate as junior-level.\nBut a lot of the time the manager needs the junior employee to work on something complex and important. They don’t trust the junior person to handle everything on their own, so they need to scope it down. A common way to scope a complex problem down for a more junior employee is to give them more scaffolding:\nTell them the problem they need to solve\nTell them what the solution should look like\nTell them step-by-step how to achieve that solution\n(credit to\nShishir Mehrotra’s PSHE framework\n).\nSo for complex, high-impact projects, the interviewer needs to figure out how much of the problem and solution were handed to you, and how much you drove on your own.\nIf you drove the whole project from figuring out the problem all the way through discovering and implementing the solution, there might be 3 or more different stories you can tell about the one project. Pick the most senior one as your primary story, and keep the details of the others for when you need to highlight a specific strength in execution.\nWhat were the expectations you were handed, and what did you decide to do?\nTo accurately portray your seniority, you need to make it clear which parts of the scaffolding you were or were not given. What details do you have that set up the context to highlight the contrast?\nCompany leadership thought our biggest opportunity was going after the educational market, but I dug into competitive research and found out…\nMy manager thought we’d solve our new user adoption problem through an onboarding tour, but looking at the data I realized…\nThe previous PM had tried to work with our partners by sending them weekly status updates, but through talking to them I learned…\nPop quiz\n: If you want to make these even better, should you emphasize how good the previous direction was, or how bad it was?\nDo you throw in a detail that emphasizes how wrong your manager was? “She was brand new to SAAS products so she didn’t understand that tours don’t work.”\nOr one that makes it sound like she might have been on to something? “Our closest competitor had added a tour 3 months ago and we were hearing that it was working”.\nMany candidates get this wrong.\nAnswer\n: If you make the initial direction sound clearly bad, then it wouldn’t take a genius to switch to a better direction. It also makes me wonder why you’re badmouthing your previous coworkers, and if maybe you were missing something.\nIf you show all the reasons why the initial direction seemed good, now your pivot sounds impressive. It would have been easy to go along with what people expected, and you understood why they liked that direction, but you went above and beyond to identify something better. Now I start to feel like you might come in and teach me something.\nYour insights\nYou might have noticed that the examples above all go “Other people thought X, but I realized…”\nThat’s because we’re highlighting the contrast between what would have happened without you, and how you made a difference.\nThere’s some reason that you decided not to go with the flow\n, and that reason is the insight you had. We could also call this your “Aha moment” or Epiphany in the PEARL framework.\nYour insights and\nhow you came up with them\nare a huge part of the value that you bring. As an interviewer, this is what helps me understand you and what you might do at my company. If you tell me an insight on it’s own,\nI don’t know how much to believe you\n.\n“I realized our onboarding flow was too difficult” is vague and I’m not convinced. Every APM wants to make onboarding easier. Even if I believe you, I don’t have a sense for how bad the problem was or how easy the solution would be.\nIf the onboarding pages crashed for half your users and you prioritized fixing that, good for you, but also, duh obvious. I’d say this is a case of taking “Project you’re proud of” a little too literally.\nSide note: a nice way to handle this, that many candidates do, is to quickly mention this low-hanging fruit win but then spend your time talking about a meatier project.\nYour insight should be non-obvious.\nNow, just because the insight should be non-obvious, doesn’t mean that the way you found it needed to be.\nMany of these insights are powered by some kind of research you did, either in the moment or earlier in your career. Maybe you were talking to a customer, maybe you watched a user research session, maybe you sliced the data a certain way, maybe you learned something in a blog post or at a conference last year. The other common driver is your own past experience, you saw something like this before.\nSince the broad strokes of how you came up with the insight are not that impressive nor unique, you need to share the specific details of what you found and the connections you made. This is a chance to teach the interviewer something and show off your expertise.\nExamples\nHere’s a few examples from my own experience\nEarly at Asana we were trying to figure out our target customer so I put together a giant spreadsheet of potential target use cases and what features we would need to be a great solution for each use case. Looking at it, I could see that some use cases would have a large valuable target market, while others were smaller. And for some use cases we were really close to being the best solution out there, while for others there was years of feature work required. I realized that some of the smaller use cases like sprint planning were a near-subset of larger use cases like bug tracking. This helped us put together a plan to win some use cases quickly while we built toward bigger ones.\nI’d been looking at the data for Asana and pondering how to improve word of mouth growth, since normal people don’t really recommend task managers to their friends. I noticed that the one thing people got really excited about was our off-by-default unicorn celebrations. Putting these together, it felt worth a try to turn unicorns on by default, and we were able to measure a win by tracking tweets.\nI started walking through the user journey for\nOpenBallot\nand had learned from the team that we expected a lot of users to come in on election day through Google searches. I knew from past experience that these users will bounce if they don’t immediately find useful content on the landing page, so I realized we needed to change our model to optimize for logged out users.\nNotice how these get fully into the details, the same way I’d describe the situation to a coworker while it was happening. I’m not spending much time on the process, but I am really trying to share all the things I was thinking about, remembering, noticing.\nWhen you read these, do you believe I’m telling the truth? Do I sound like I’m accurately portraying my contributions or do you have a hunch that I’m exaggerating? Do I sound like I’m bragging too much or conversely like I’m just talking about my team’s accomplishments?\nMy guess is that you believe me because I’m talking about what the experience was like in the moment.\nChoices/Options/Tradeoffs\nWhen you’re applying to senior level roles,\ndecision making is 1/3 of the rubric\n.\nI like to think of it this way: if the decision was easy, someone else on my team would have made it already. Hopefully I’ve already empowered my team with the goals, principles, and frameworks they need to answer easy questions. If the decision is coming to me, it must be complex, and deserves some intentional thinking.\nWhat were the complex choices on your project?\nJust like with Starting Context above, you want to make the other options sound as good as possible. Explain the pros and cons of each side. Describe what tipped you over to the choice you went with, and how you mitigated the tradeoffs.\nWhat were the options?\nWhat were the pros & cons on each side?\nWhat tipped you over to the decision you made?\nHow did you mitigate the tradeoffs?\nFor a large project you might have several examples of complex choices and tradeoffs. If you have time, jot down the details for each of them so that you can use them as examples of specific strengths or situations.\nIn the interview itself, you can briefly hint at each, but\ndig into just one\n: “There were a lot of interesting decisions, we had to figure out the data model, testing plan, and marketing approach, I can dig into any of those if you like, but I think the most interesting was how we handled it when we realized the vendor’s product didn’t meet our requirements”\nPushback\nPushback (or as interviewers might phrase it, conflict) is expected in complex projects. Many interviewers will explicitly ask you to talk about a conflict at work.\nStepping outside of interviews for a second\n, when you’re at work you\nshould\nbe handling pushback by genuinely listening to understand the other person’s point of view.\nI know this doesn’t come naturally in a lot of company’s cultures. At Google and Microsoft it was common in hallway conversations to talk about how annoying salespeople were with their useless feedback. Or to complain about the terrible people on another team who wouldn’t help out with what your team needed.\nPlease avoid this temptation — you’re all working at the same company with the same shared mission. More than that, when you fall into the trap of thinking your team is better/more-important than other teams, you’re failing to grasp the bigger picture of how your company works, which means you can’t make informed decisions.\nOnce you understand the other’s point of view, you have lots of options for how you handle it. Maybe they’re making a valid point and there’s a win-win solution that works for both of you. Maybe they’re surfacing a higher level strategic misalignment that you can tackle with the right people in the room. Maybe you have some facts you can share that will bring them to your side. Maybe they need a different kind of communication from you to do their job well.\nBack in interview land\n, you might want to prepare 2 examples of pushback.\nThe first is your best time handling pushback — the time when you really went above and beyond understanding the stakeholder’s point of view and coming up with a much better solution than expected. That’s the one you can use if you’re asked to talk about a conflict.\nThe second is the best example you have of pushback in the project you choose for your\nseniority story\n, in case they decide to specifically ask about conflict on that project. If you’re especially proud of how you handled it, you can include it in your original answer.\nYour strategy and values\nWhen you’re working on a project, you don’t reinvent the wheel at every step. Instead, you learned what works and what doesn’t over time, and you accumulated those experiences into a strategies, principles, and values.\nFor your story, think about each action you took and whether there was a hard-earned principle behind it. Things like prioritizing user trust, balancing speed with quality, or aligning stakeholders by giving them each a chance to be heard.\nWhen you’re telling the story, you can include these principles to show off your expertise. “Whenever I put together a roadmap, I like to check that we have the right balance between improving existing functionality and enabling new use cases…”\nThe results\nAt the end of your story, the interviewer is going to try to assess whether you actually did a good job.\nWhen thinking about your results, numbers are good, but they’re not always enough. How do I know if your 10% increase in adoption was impressive or not? Include the context to help the interviewer interpret it — maybe the team expected you to have only a 2% win, maybe this was the largest adoption win that year. Find the details that are convincing.\nWhat not to include\nOkay, so there are a lot of details you need to include, and you don’t want your story to be longer than 5 minutes, so what can you skip?\nProcess\n: Don’t list out basic steps (I wrote a PRD, I joined the standups, I asked for approval), unless the interviewer has indicated they want to hear them.\nMultiple challenges\n: Pick your best 1 or 2 challenges to dive into, and for the rest just let the interviewer know you could dive in if they want. Especially skip the stories that aren’t demonstrating an important skill or value.\nBoring stuff\n: If you’re excited about something, you can sell it well. If you can’t talk about something with high energy, skip it.\nConclusion\nA good behavioral interview response will get detailed and specific on the impressive parts of your story.\nThis prep is easier to do with a buddy, so try out this custom GPT,\nFind the Impressive Parts of Your Story\nGood luck!\nIn case you missed them,\nCracking the Behavioral Interview: Build up your Interview Confidence with a Wins Warmup\nCracking the Behavioral Interview: \"Tell me a project you're proud of\" - 4 Mock Interviews\nCracking the Behavioral Interview: What is the interviewer looking for?\nCracking the Behavioral Interview: Which project should I talk about?\nCracking the Behavioral Interview: What makes a story impressive?\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n2\n1\nShare\nDiscussion about this post\nComments\nRestacks\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:19:53.652534"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/behavioral-interview-what-makes-a-story-impressive",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Cracking the Behavioral Interview: What makes a story impressive?\nIf things went too smoothly you'll sound junior. Here's how to fix it.\nJackie Bavaro\nJul 28, 2025\n10\n1\n1\nShare\nIt’s tempting to talk about your past work in a way that makes you look like you did everything right. The projects you prioritized were the obviously correct choice. Everyone immediately saw how good your solution was and supported it. Thanks to your amazingness everything went smoothly.\nBut, does that really make you sound impressive?\nImagine if a friend was telling you about a hike. They’d packed enough water, made no wrong turns on the trail, the weather was great, and their legs don’t even hurt. Do they sounds like a great hiker? Or does it sound like maybe they just picked an easy trail?\nPhoto by\nSamuel Clara\non\nUnsplash\nYou’d be more impressed if they made it sound harder. The weather was bad, the trail markings were confusing, it was slippery and steep, they almost gave up but pushed through.\nThe same idea applies to your interview answers, especially the ones where you want to show seniority.\nThe trick to sounding impressive is to show how\nhard\nthe work actually was\nYou’re probably proud of your project because of how well it went. But instead of starting with everything that went well, you need to set up the contrast and make the interviewer believe that it\ncould\nhave gone really poorly.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nIt’s not easy to make your project sound hard, especially if you’re really good. You probably made a lot of good early choices that avoided problems later on. So here are some prompts to help you surface what was impressive about your work\nWhat would a junior person have done differently?\nWhat did you do differently than your boss expected you to do?\nWhat aha moments or insights did you have?\nDid your strategy or principles drive a decision?\nWhat do you brag to your best friend about?\nLet’s dig in.\nWhat would a junior person have done differently?\nImagine someone less skilled had been in your shoes. Would they have done exactly what you did? If so, this isn’t a great story.\nThink about how you might have handled the situation earlier in your career. Maybe you have some new best practices that you follow. Maybe you’ve learned more about your customer, the technology, or the industry that you used to make good decisions. Maybe you understood the importance of a factor that a more junior person would overlook?\nWhat did you do differently than your boss expected you to do?\nIf you just did what your boss told you to do, that’s not very senior. What did your boss (or other leaders) think you’d do? What did you do differently? Why did they think the first idea was good, and why did you decide your approach was better?\nMany of the best answers sound like “Everyone thought we should do X, but I realized we should do Y.” It makes it clear how easy it would have been to go with the flow, but you stepped up and steered in a better direction.\nWhat aha moments or insights did you have?\nIf your idea was so good, why didn’t everyone already think it was the right choice? It’s probably because you saw something that no one else saw. Or you realized the importance of a fact that people were ignoring.\nOften these insights come from watching a user, looking at data, listening to a talk, or trying to solve an intractable problem. Think about the times that it felt like the pieces fit together. Think about the times that you felt a conviction about the right path to pursue. What were the times when you thought “Wait a second…” and dug in?\nDid your strategy or principles drive a decision?\nSometimes the most impressive things you did feel invisible to you because they’re just part of your internalized strategy or principles.\nWhen we talk about seniority, a big part is the expertise that you've developed over the years. All the things you've seen, all the experiences you've had, all the conferences you've gone to, all the newsletters you've read, all of this comes together inside your brain leads you to good good decisions.\nMaybe you have a principle to alway invest in usability, or that you need to serve basic users and power users, or that designs should be future-proof. Maybe your strategy was to move fast and quickly validate ideas, or to build strong partnerships. Maybe you believe that team morale needs to be addressed first.\nTry to identify the strategies and principles behind your decisions and approaches. Can you remember when you first developed those strategies and principles?\nWhat do you brag to your best friend about?\nGetting gossipy can help you break through your internal censor that wants to be diplomatic.\nA lot of us have a voice that says we shouldn’t brag, or we shouldn’t admit that our coworker was a real pain, or we shouldn’t talk about the sneaky way we got things done.\nAnd to be honest, that voice is somewhat right - we can’t tell those stories as-is. But, once we’ve identified the impressive stuff we did, we can find more diplomatic ways to tell the story.\nPractice\nYou can go through these questions alone, but if you get stuck, try going through them with someone friendly who knows your work. They might be able to point out the impressive things you did that you miss.\nAnd if you prefer AI, I’ve got another custom GPT:\nFind the Impressive Parts of Your Story\nLet me know if these ideas help!\nIn case you missed them,\nCracking the Behavioral Interview: Build up your Interview Confidence with a Wins Warmup\nCracking the Behavioral Interview: \"Tell me a project you're proud of\" - 4 Mock Interviews\nCracking the Behavioral Interview: What is the interviewer looking for?\nCracking the Behavioral Interview: Which project should I talk about?\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n10\n1\n1\nShare\nDiscussion about this post\nComments\nRestacks\nAusten McDonald\nJul 28\nLiked by Jackie Bavaro\nI like Steve's take on using story arcs for this :)\nhttps://youtu.be/hU6BVxtGd5g\nExpand full comment\nReply\nShare\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:19:54.998101"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/behavioral-interviews-which-project-to-talk-about",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Cracking the Behavioral Interview: Which project should I talk about?\nLet's figure out which stories to prepare\nJackie Bavaro\nJul 22, 2025\n8\n5\n2\nShare\nYou walk into a breakfast buffet and grab a tray. Cereals is right by the entrance so you fill a small bowl. Then the muffins, delicious! Strawberries and yogurt? Sure, why not?\nYou’re just reaching the bacon and french toast when a waiter stops you and says, “That’s all for today,” gently guiding you back to your seat.\nWait!\nFrench toast is your favorite food!\nYou wouldn’t have wasted space on cereal if you’d known there was a limit.\nInterviews can be like that.\nBefore you know it, the interviews are over and you never even got to talk about your most impressive work.\nChoosing the right project to talk about really matters. It’s a key part of\nhow your answer is assessed\n.\nYou might honestly be proud of an easy side-project early in your career that helped a lot of people. But if that’s the story you tell, the interviewer might walk away thinking easy projects are all you’re capable of.\nThe right project to talk about depends on the type of question. Let’s dig in.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nSeniority questions\nThese questions sound warm and open-ended:\nTell me about a project you’re proud of\nTell me about a recent project you worked on\nDescribe a project you managed from start to end\nTell me about a time when you had to win people over\nTell me about a complex project\nTell me about a project where you had to set the strategy\nThey sound like you can pick any project that fits, but that’s not quite it.\nThey want to know:\nHow big of a challenge can they trust you to independently lead and deliver impactful results?\n“Complex,” in this context, doesn’t mean “hard for you personally because you had to learn a new tool.” It means “not easy enough to be handled by a junior person because of external factors like  ambiguity, risk, or tradeoffs.”\nWhich project?\nRule of thumb:\npick your most recent, successful, high-scope project.\nIf it’s from five years ago, they’ll learn how senior you were\nthen\n.\nIf it’s still in progress, you won’t have results to show that your decisions were right.\nWhat if you don’t have a good project to talk about?\nReal life doesn’t always hand us the perfect case study. Sometime you don’t have a single project that covers all\nthe senior skills\n.\nMaybe you’ve been working on high-priority but straightforward projects. Maybe you joined the team late or left early. In these cases, see if you can show all the competencies across multiple projects.\nIf the projects are related, try to elevate your story to be about the portfolio of projects. You can talk about the higher-level goal and project choices.\n“I’m really proud of the pinch-hitting work I did across multiple teams to get all of our teams shipping high quality work quickly.”\nIn this example, the candidate was sent by leadership to work on a variety of teams, mostly at the execution stage. Even though she didn’t select the project, she can show ownership over the goals and emphasize her repeatable approach.\nIf your projects are unrelated you can name drop them to get partial credit for multiple wins.\n“Would you like me to talk about the time I discovered a huge product opportunity for an end-of-life product line, or would you rather hear about the time I came into a team that hadn’t been able to launch in 2 years and I was able to turn things around?”\nIn this example, the candidate had multiple internships and wasn’t able to see a project through end-to-end. He’s able to convey the breadth of his experience instead of being stuck talking about just one aspect.\nGrowth questions\nThese flip the script. Instead of “how senior are you now?” they ask:\nHow have you grown?\nYou can recognize these questions because they directly ask about a time you messed up (not a difficult situation everyone faces, like a tricky stakeholder):\nTell me about a failure\nWhat’s your biggest weakness\nTell me about a time you got tough feedback\nTell me about a project that went off-track\nTell me about a time you missed a deadline\nTell me about a project that you wish you had done better and how you would do it differently today\nThink about it this way: if you time traveled back 3-5 years ago, would you have run those projects exactly the same as you would now?\nOf course not! You’ve been making mistakes and learning from them. That’s what the interviewer wants to see.\nWhich project?\nRule of thumb:\nchoose an\nolder\nproject. Something you’ve clearly learned from\nand\nhad the chance to apply.\nThese questions can actually be a chance to highlight your best strengths and values. You’re getting a chance to tell the origin story of your values.\n“A failure that made a big difference in the way I work was a time that I deferred to a founder’s belief in what we should build. I skipped the uncomfortable conversations that it would have taken to get aligned, and when the experiment failed he felt like we hadn’t really tested the thing he believed in. I’ve learned now to create a decision-making framework in advance: we review the experiment and what we’d do next in each outcome, and that helps surface the precise beliefs we need to test.”\nThis is one of my own examples, and I use it to highlight how I balance respect for the founders’ vision with product rigor.\nThink about which of your strengths you want to highlight, and pick the failure stories that match.\nSpecific Strengths and Values Questions\nSome questions are testing a specific strength or value. You’ll usually hear them framed one of three ways:\nDirect\nTell me about a time you worked on a project that had legal regulations (Subject Matter Expertise)\nTell me about a time you dived deep into a problem (Dive Deep)\nTell me about a time you had to show good collaboration (Collaboration)\nTell me about a time you helped someone improve their skills (Coaching)\nNeutral\nTell me about a project where you used data (Dive Deep)\nTell me about a time you worked on a cross-functional team (Collaboration)\nTell me about a time you coached a report (Coaching)\nNegatively framed\nTell me about a time when data lead you astray. (Dive Deep)\nTell me about a conflict you had with another person (Collaboration)\nTell me about a time you had an underperforming report (Coaching)\nAll of these questions are constrained to specific situations that you might face. You can guess which strength they’re testing by the constraint.\nWhich project?\nDon’t let negative framing trip you up! Identify the strength or value they’re looking for, and\npick a story where you demonstrate the strength\n.\nIf you’re talking to the hiring manager and you haven’t already told a story that demonstrates your seniority, see if you can\npick a story that demonstrates the strength\nand\nseniority\n.\nIf you’ve already told a story about a big successful project or if you’re being interviewed by someone at the same level as you, it’s likely that they’re just testing for the strength; don’t worry about seniority, focus on picking a good example for the strength.\nDon’t pick the worst interpretation of the question\nAs you’ve seen, sometimes these questions are framed to trick you into telling a bad story. You get to choose which stories you tell, so don’t pick the ones that make you look really bad.\nI worried a little about including this chart, since the trick question aspect is designed to catch people who naturally gravitate towards anti-social behavior or who really were bad at their jobs.\nBut, in practice, I don’t think I’m spilling the beans on a deeply kept secret. I’ve also seen that the problematic people don’t realize how bad their stories are and so they keep telling them.\nBrainstorming Stories\nNow that you know how to pick stories, start brainstorming stories for your story bank. You’ll want at least 5, but 10 is better. You won’t need to fully develop all of them, but it will be helpful to have several as backup.\nHere are some prompts to help you think of stories:\nWins\nProjects you're proud of\nProject you led from 0 to 1\nProject with cross-functional collaboration\nStrengths\nSubject matter expertise\nCustomer Focused\nUser centered design\nData Oriented\nTechnical\nScrappy\nEthical\nand so on\nChallenges\nHard to get approved, but you convinced people\nHard to figure out solution, but through your insights you figured it out\nHard to market, but through your work you succeeded\nNeeded a lot of iteration, eventually succeeded or set things up for a future success\nProject fell behind schedule\nBig surprise obstacle, that you overcame\nExternal problem, that you dealt with\nYou made a mistake, that you learned from and avoided in a future situation\nConflict with a coworker that you resolved skillfully\nYou can also walk through your career chronologically to jog your memory. Write down each of the major projects and interesting side projects.\nWhat if they ask a question and you don’t have a good example?\nSome interviewers want to push you to answer a question you haven’t prepared for, or they care about a specific type of experience you weren’t expecting.\nFirst, don’t panic. This doesn’t mean you didn’t prepare well enough, and it doesn’t mean that you don’t have the right experience. The interviewer wants to see what you say when you can’t recite a memorized answer. If your skills & values are real, they can still shine in an on-the-fly answer.\nTake a moment to think about the situation presented in the question. Maybe they asked “Tell me about a time when a key person on your project suddenly left.” What’s the problem they’re getting at?\nWell, when a key person leaves you’ve got a few problems: the schedule was counting on their work, the implementation might have counted on their expertise, team morale might be at risk.\nValidating and empathizing with those problems is a great quick response while you make time to think about which story you want to tell. If this is a familiar situation, make sure you convey your “been there, done that” confidence.\n“Oh yeah it’s definitely tough when a key person leaves the team. You need to find a replacement, decide if it’s okay for the schedule to slip, and make sure the other people on the team are still feeling supported. Let me take a minute and see if I can think of a good example to tell you.”\nAs part of this empathizing, you can start to get a sense for the strengths the question might be testing for. In this case, it’s probably overcoming obstacles and keeping a project on track.\nNow we want to think of a good example. Maybe one popped into your head, or maybe one of the stories you brainstormed is close enough because it demonstrates the same strengths. You can ask, “This isn’t exactly the same but there was a time our designer got pulled into another project and only could dedicate 25% time to ours, would you like to hear about that?”\nThe big trick here is\ndon’t pick the worst interpretation of the question\n. Double check that you’re telling a story that demonstrates your strength. In this example, don’t tell a story about a time you fought with a key person and caused them to leave in the middle of the project, that’s not what they’re asking!\nFinally, if you can’t think of any stories, talk about what you would hypothetically do in that situation. Sometimes your hypothetical answer will show enough expertise on the problem to count as a good answer.\nGood luck!\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nIn case you missed them,\nCracking the Behavioral Interview: Build up your Interview Confidence with a Wins Warmup\nCracking the Behavioral Interview: \"Tell me a project you're proud of\" - 4 Mock Interviews\nCracking the Behavioral Interview: What is the interviewer looking for?\n8\n5\n2\nShare\nDiscussion about this post\nComments\nRestacks\nShellie\nJul 27\nLiked by Jackie Bavaro\nThis is such thoughtful, practical advice. It takes the fear out of tricky questions and puts the focus back on showing who you really are.\nExpand full comment\nReply\nShare\n1 reply by Jackie Bavaro\nAusten McDonald\nJul 23\nLiked by Jackie Bavaro\nI love this and usually advise my coaching clients to choose a project at the intersection of scope, impact, and personal involvement.\nI like the awareness of where you are in the interview (\"Have I covered this yet?\") and properties of the interviewer (\"Is this person more senior than me?\").\nExpand full comment\nReply\nShare\n2 replies by Jackie Bavaro and others\n3 more comments...\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:19:56.645012"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/what-is-the-interviewer-looking-for-project-youre-proud-of",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Cracking the Behavioral Interview: What are they really looking for?\nHow interviewers evaluate seniority & strengths\nJackie Bavaro\nJul 16, 2025\n11\n3\n1\nShare\nThis article is 3rd in a series about behavioral interviews. We started with\ngetting into a confident mindset\n, then put you in the interviewer seat in\n4 mock interviews\n. Today we’re getting deeper into our user research on how interviewers think.\nImagine you’re choosing a captain to sail you and your friends around the world. You’ve got a long list of weird, wonderful destinations from a floating market in Thailand to a hidden fjord that’s dangerous at high tide.\nWho do you pick? Do you want the person who’s read all the books and has a prepared answer for each situation you name? Or do you want the person who steered through fog before? Who handled the changes when ports are closed?\nYou want the person who’s seen it all and stays unflustered.\nThat’s what a behavioral interview reveals. When they ask “Tell me about a project you’re proud of,” they’re really asking if they can trust you to get them through this next adventure.\nWhy not just ask hypotheticals, design problems, analytical questions, case studies, and so on?\nPre-canned questions are neat and clean. If you’ve studied hard enough you can figure out the right answer.\nBut doing the right thing in the real world is messier. You’re tackling new, never-solved customer problems. There are complex business and interpersonal factors.\nGetting a good result takes insight, judgement, relationships, attention to detail, grit. Behavioral interviews are a window into these harder-to-measure factors.\nThey’re trying to predict the future by looking at your past.\nWhy not just look at your resume?\nResumes tell you what happened.\nThey don’t tell you\nhow\nit happened.\nThey don’t tell you if you were the one who made it happen.\nThey don’t tell you if your approach alienated your coworkers.\nA resume says: Senior Product Manager.\nA good behavioral answer says: here’s the judgment I used, the strategy I set, the tradeoffs I wrestled with, the way I brought others along, the impact I owned.\nThat’s what interviewers are looking for:\nScope. Autonomy. Impact.\nAnd whether you can deliver that in a way that fits with the company’s values and work style.\nPhoto by\nGlenn Carstens-Peters\non\nUnsplash\nWhat does seniority actually look like?\nTech jobs like product manager, engineer, and designer change as you advance.\nEarly in your career your job is building and shipping products: writing PRDs, designing screens, writing code.\nLater, your job is deciding what to build and why.\nAs Senior PM, Design Manager, or Eng Manager you shift from execution to strategy.\nYou look into the future and advocate for new opportunities.\nAnd from there, the leap to director and beyond is about scaling through others: Organizational Excellence.\nHere’s how this growth looks for a product manager:\nLets make that more concrete.\nHiring for junior roles\nThey want someone who can get the job done. People eager, hardworking, and coachable. Someone with the potential to earn trust and and grow over time.\nHiring for senior roles\nThey want someone who can be trusted to run independently.  People who already know how to set strategy and deliver great results without much hand-holding. Someone who shows good judgement.\nHiring for director+\nThey’re looking for leadership in both senses of the word: someone who can run an organization AND elevate the leadership team they’re a part of. Someone who thinks company-first, builds high-performing teams, and contributes to organizational excellence—not just their own team’s output.\nSo how do you assess that in an interview?\nBehavioral questions are less likely to have an official rubric. The hiring manager trusts their gut.\nLuckily, that gut intuition has some basis. Let’s break it down.\nJunior level\nThey’re hired for potential. The question is: do they show hunger, humility, and enough relevant experience?\n✅ Led a project from beginning through launch. Can be side project or non-tech.\n✅ Shows basic values for the role (eg. customer focus for PM, usability for design)\n✅ Willing to work hard and see things through\n✅ Enthusiastic to learn\nNo-hire signals for people with relevant experience tend to be about attitude and mindset: lack of effort, lack of curiosity, big ego. For product managers, I’m mostly checking for\nProduct Mindset\n, to make sure I’m not hiring a\nproject\nmanager.\nSenior level\nRegardless of your title, senior-level people are hired for trusted, strategic ownership. Here’s what good looks like.\nThe project\n✅ Identified & prioritized an opportunity (vs. being assigned it)\n✅ Results were successful and impactful (and connected to company strategy)\nDecision-making\n✅ Grappled with tradeoffs, considered the pros and cons of each side.\n✅ Saw the merit in other people’s points of view and addressed or incorporated their feedback.\n✅ Made good decisions using their bigger picture expertise and judgement.\nOwnership\n✅ They were the expert.\n✅ Skillfully influenced other people to get their direction supported, even over pushback\n✅ They didn’t hide behind leadership—they\nowned\nthe constraints and goals.\nWeak answers often sound… passive. Like someone who’s done good work, but mostly followed the plan.\nThey didn’t ask questions, work through tradeoffs. They seem shortsighted, weighing factors incorrectly, missing better solutions. They brushed off feedback or blindly followed it.\nDirector+\nThe bar shifts again. You still need all the senior-level behaviors—but layered with organizational excellence.\nTrusted leadership:\n✅ Take a company-centric strategic perspective.\n✅ Built trust and deep relationships across the company.\n✅ Conveys confidence by being a real expert in their area\nOperational excellence:\n✅ Has a robust philosophy for the different aspects of building and running a high performing team.\n✅ Communicates a strategic vision for their team.\n✅ Delivered scalable impact through their reports — more than a few star ICs could.\nBad candidates sound like they’re new to the leadership role. They’re not conveying “been there, done that.” They identify more with the team of people they lead than the broader company they serve.\nWhat about Values and Strengths\nSeniority is just one axis. Strengths and values are another.\nQuestions like “Tell me about a time you had to make a decision without data,” or “Tell me about a conflict” are probably probing for specific values and strengths.\nThe list of values and strengths is too long for you to cover them all in a single story:\nExpertise in a specific technology, industry, or tool\nTeam player / good collaboration\nExecution / project management / overcoming obstacles\nProduct / design skills (user centered design, data oriented…)\nMove fast / scrappy\nCraftsmanship\nCurious / intellectually humble\nMission driven\nSelf-aware / coachable\nand the list goes on…\nLuckily, you can do your research. Amazon is famous for their\nLeadership Principles\n, OpenAI lists their\nvalues including Humanity first and Feel the AGI\n.\nReflect on the kind of PM you are. What values and strengths do you think are critical to your success? Highlight those in your stories.\nThe 3-point rubric most interviewers use (even if they don’t say it out loud):\nPoor\n- the opposite of what we’re looking for\nAcceptable\n- you might be good at this, but I’m not sure\nExcellent\n- I’m confident you’ll always show this strength, even when it’s difficult\nFailure:\n“Oh yeah they wanted me to make a decision without data but I’m always data oriented so I had our user research team run a survey anyway.”\nExcellent:\n“Over the years I’ve learned that waiting for data can be a crutch. I’ve really adopted Amazon’s type 1 vs type 2 decision making approach. In this case it would be easy to measure if the solution was working, and easy to iterate if wasn’t”\nAcceptable:\n“We usually run A/B tests on changes to the invite flow, but in this case we knew we needed to make the change for accessibility reasons and we had user research that indicated it would be fine, so we went ahead.”\nConclusion\nHopefully this demystifies behavioral interview questions a bit.\nTo recap, depending on the level you’re interviewing for, you’ll need to show different skills\nJunior\n: Relevant experience, role-specific values, willing to work hard, enthusiastic to learn\nSenior\n: Identify an important strategic opportunity and deliver impactful results, Make good, reasoned decisions using senior-level expertise, Take responsibility for all aspects of the project, from influencing others to owning the constraints.\nDirector+\n: Be a valuable, respected member of the leadership team, Drive scalable results through a principled approach.\nConsider whether your past interview answers have demonstrated these strengths. Look back at\n4 mock interviews\nand see if you’d grade them any differently today. For more practice, try grading the gpt\nPM Interview Candidate\n.\nGood luck!\nIf you’d like to read more, I’ve written before about what it takes to show seniority on the job:\nBecoming a senior Product Manager - Lenny’s Newsletter\n.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n11\n3\n1\nShare\nDiscussion about this post\nComments\nRestacks\nAatir Abdul Rauf\nJul 16\nExcellent article, Jackie. I especially love how you've broken down the expectations by seniority. Very relatable.\nI had a few questions that I hear from my network:\n1. Theres a strong focus on comfort with AI in interviews these days. But many PMs are still making that transition and haven't had real world opportunities to prove themselves. Some are still in the process of upskilling themselves. How can seasoned candidates stand out in Senior PM processes where expectations around AI literacy and tool usage is so high?\n2. As a hiring manager, how do you differentiate between made-up feel-good stories and genuine experiences?\nExpand full comment\nReply\nShare\n2 replies by Jackie Bavaro and others\n2 more comments...\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:19:58.114043"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/tell-me-a-project-youre-proud-of-mock-interviews",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Cracking the Behavioral Interview: \"Tell me a project you're proud of\" - 4 Mock Interviews\nPut on your interviewer hat and see who you'd hire!\nJackie Bavaro\nJul 09, 2025\n8\n3\n1\nShare\nThis article is 2rd in a series about Cracking the Behavioral Interview. We started with\ngetting into a confident mindset\n, today we’ll  put you in the interviewer seat. Future articles will cover what interviewers are looking for, which projects to talk about, what makes a story impressive, what details to include, and how to put it all together into the\nPEARL framework\n. Subscribe for free to get the future articles!\nAfter last week’s post on\nbuilding your confidence with a wins warmup\n, you might be eager to practice your own interviews. But, before we start solution-ing, we need to really understand our customer… in this case, the interviewer.\nWhen you’re deep in the weeds of practicing your interview answers, it can be tricky to understand how your responses come across. So, instead of practicing\nyour\nanswers, today you’re going to put on your interviewer hat and see how you feel about other people’s answers. And next week we’ll get into some rubrics to make those feelings more objective.\nLet’s evaluate some candidates!\nTo set the scene, imagine you’re a hiring manager, looking to hire a senior PM to work on your team. You’ll be interviewing 4 candidates.\nListen to each of them talk about a project they’re proud of and see what you think about them.\nWould you want to hire them?\nHow confident are you?\nDoes any part of their answer give you doubts that they’d be right for the job?\nWhat do you assume based on their story?\nLet’s get into them.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nCandidate A\nI'm really proud of a customer-focused project at my last team. Our team helps sales managers understand their sales pipelines so they can optimize and close more deals.\nDuring user studies, I noticed customers copying the pipeline from our website into Excel to tag risky deals. I wanted to understand why, so I asked follow-up questions and learned that they’d do some calculations on our fields which worked well in Excel, once they’d done the work of copying each page of the pipeline. Digging into the data, I saw “export” was a top customer support request. So, I proposed we build CSV export — it would save managers a good amount of time.\nI worked closely with designers and researchers to decide how the export functionality should work. The design was tricky because there were so many columns and filters. Through research we found that the current view was a good default, but a significant set of users also needed customization options. We landed on a split-button design so that the default options would be quick, while the customizations were still available.\nI ran stand‑ups, briefed Customer Support, and the launch was successful. 60 % of managers used in‑app export and the customer feedback was positive.\nWhat do you think? Does candidate A get the senior PM job?\nIf you’re like many people, you think that candidate A did a good job structuring their answer, but they just seem junior. CSV export is a straightforward feature, and it doesn’t take much strategy to build the top customer request. They followed a lot of PM best practices, but I’m not sure they’re having much impact on the company goals. Nothing they’ve said hints that this might be a more complex project - it sounds easy. Basically, they seem like they’re doing a good job of being an APM.\nDuring your interviews, are you telling any stories like Candidate A’s?\nMaybe you picked a story from early in your career, or you picked a really easy recent project. Or maybe the project was really meaty and complex, but you’re making it\nsound\ntoo easy when you talk about it.\nDo you sometimes jump right into your team’s work without setting the company context? Do you talk about your results just in terms of what it meant for your launch, instead of how it moved the company’s goals?\nCandidate B\nI’m really proud of launching proactive pipeline control because it’s a major product and impacts millions of users.\nI joined the CRM Pipeline Intelligence team and needed to set up a vision, requirements, and roadmap. It was really complex and I needed to work with 20 stakeholders over 2 years. I met with customers and determined their biggest problems and found a new opportunity.\nThere were a number of challenges. I needed to learn about AI and work with engineering to learn new AI techniques. I also worked with our sales and support team to make sure all our customers understood how to use it.\nIt's been a big success, earning $50M in revenue and with over a million users.\nWhat do you think? Does candidate B get the senior PM job?\nThe good news here is that this candidate seems to be more senior and seems to have had really impressive impact, with high revenue and usage numbers. Also, it’s short enough that the interviewer will have time to dig in with follow up questions.\nThe bad news is that this answer is entirely generic and shallow. It’s not telling us anything about what the candidate actually did, or even what the product is. It seems like this candidate is obsessed with process. They don’t seem very customer focused. It’s also mind-numbingly boring.\nAt first it seems nice that they talk about a challenge. But the challenge isn’t something inherently tricky about the project. It’s a personal challenge (needing to learn new technology), and I’m left wondering if a better PM wouldn’t have found this as challenging.\nIf you’re answering questions like this, don’t worry\n— I’ll have tips in the rest of this series to help you figure out what parts of your story are impressive and what details you should be including.\nCandidate C\nI'm the PM for CRM Pipeline Intelligence.\nI'm really proud of launching proactive pipeline control. It uses AI to predict risk and provide sales managers with early warning on risky deals.\nWe prototyped risk-scoring and it worked well but was very slow to run. I worked with engineering to iterate on our ML approach to improve performance. We also built alerts and launched to trusted testers. They loved it so we launched to everyone.\nIt's been a big success with a large increase in new customer acquisition and even modest retention wins\nWhat do you think? Does candidate C get the senior PM job?\nIn contrast to candidate B, this candidate gets into some of the details. We find out what “proactive pipeline control” actually does, and we get a bit more of a hint of customer focus and technical skill.\nBut, what did candidate C do, in particular? There’s a lot of “we” which raises the doubt that maybe they just called the meetings and took notes while everyone else figured things out. It sounds like their manager might have said “Go join this team that’s using AI to predict risk” and they just helped get the project across the finish line.\nPersonally, I like that candidate C is calling out not just a revenue increase, but which mechanisms (new customer acquisition & retention) drove the increase. It shows a deeper understanding of how the business works. But, without an impressive number like $50M, I don’t really know how big of a deal this launch was.\nWhen you’re interviewing, does your desire to be collaborative and give your teammates credit cause you to miss showing your personal insights and impact?\nIt’s tough to brag about ourselves.\nCandidate D\nI’d love to talk about the strategy I lead that helped my company go from the #5 sales solutions for auto dealerships to the market leader.\nWhen I joined the team I went on lots of site visits. One thing that stood out was several customers manually copying the pipeline into Excel to tag risky deals.\nSo, for background, sales managers have several levers they can pull to save a risky deal, things like offering discounts. But they only want to offer a discount if they think the deal would otherwise fall through. I learned these managers were copying into Excel to do some simple calculations.\nI realized that we had the data to do much better risk prediction than what the managers were getting from Excel. Using machine learning, we could provide earlier warnings so they could save more deals. This felt like a promising strategic direction because we could upsell the risk prediction for increased revenue, and we could market the AI to gain market share.\nWhenever I work on product strategy, I start with cross-team brainstorming. It gets teams involved early, gets good ideas out, and helps everyone feel bought in.\nThe big strategic question that came out of those early meetings was whether to focus on managers or directors. Dashboards for directors would optimize for expansion revenue, but I saw it wouldn't get us the quick wins that manager features like ML risk-scoring and alerts would. Quick wins also let us validate as we work towards our north star vision.\nLast quarter we launched Proactive Pipeline Control with those manager features and it's been a big success. It’s brought in an additional $50M in revenue, mostly through new customer acquisition.\nWhat do you think? Does candidate D get the senior PM job?\nYour answer might still be no, and that can be very valid depending on what you’re looking for on your team. But I really like candidate D.\nThis candidate does a few things that make them seem especially senior. They’re\nteaching\nme about their customers which helps me follow the story and understand the user problems. They\nknow their industry\n& technical space enough to know what’s possible. They’ve\nconsidered the strategic implications\nin relationship with company goals. Phrases like “whenever I work on product strategy” show that\nthey’ve done this a few times\nand they’re ready to teach other people how to do it.\nThe story highlights their\nkey insights\n(“I realized…”, “I saw…”), which makes it clear they weren’t just along for the ride.\nThe tradeoffs discussion about directors vs. managers shows off their\njudgement\nand how they think about problems. I learn a little about their product management philosophy. It also makes it clear that this wasn’t a straightforward “build what the customer asks” project, but one where it could have gone multiple directions, and they chose a good one.\nWhen you interview, do you talk about your key insights and discuss tradeoffs?\nAre you giving interviewers background on your product, industry, and customers so that they feel like they’ve learned something interesting from you? Do you make the problems feel hard, then show how you solved them?\nConclusion\nThese four candidates represent four common patterns:\nA - Project without much complexity\nB - Generic,  process-heavy answer\nC - Too much “we”\nD - Bringing the complexity to life\nNow, imagine that B, C, and D were the same person, who did exactly the same things on the project and lead the team to equal success. The only difference was how they chose to talk about their work in an interview. As an interviewer, they\nfeel\ndifferent.\nPhoto by\nDylan Gillis\non\nUnsplash\nHopefully this practice gave you insight into how your interview answers sound to an interviewer.\nIf you’d like to keep practicing, try out this\ncustom GPT: PM Interview Candidate\n. It can pick a random-skill candidate for you to interview, and it works in voice mode for a more natural experience.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nIn case you missed it: try out last week’s\ncustom GPT: Wins Warmup\n.\n8\n3\n1\nShare\nDiscussion about this post\nComments\nRestacks\nJuan Rafael Lopez\nJul 10\nLiked by Jackie Bavaro\nThis was excellent. Really appreciate it you flipping the script\nExpand full comment\nReply\nShare\n1 reply by Jackie Bavaro\nKyn Lassi\nJul 26\nLiked by Jackie Bavaro\nThis really hit home for me. Especially \"C - too much we.\" I know that I am the Product Manager, but there are so many others who contribute to the success of any product that I feel \"bad\" not acknowledging their roles. It's something that I will work on.\nExpand full comment\nReply\nShare\n1 more comment...\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:19:59.591716"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/behavioral-interviews-build-up-your",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Cracking the Behavioral Interview: Build up your Interview Confidence with a Wins Warmup\nA two-step tool for building up your confidence so that you can shine in interviews\nJackie Bavaro\nJul 03, 2025\n12\n2\nShare\nI was doing a series of interview coaching calls (in preparation for this series on behavioral interviews), and I was struck by a mystery.\nMany of the calls went really well. People shared a project they were proud of, I probed, flagged what sounded unimpressive, and we brainstormed the details that best highlighted their skills.\nBut some calls fell flat. They got defensive, fixated on surface-level issues, and tried to steer us to fit their current story into a framework. It felt like they were avoiding the real substance of their experiences and just looking to check boxes.\nSoftening the feedback didn’t help.  Following their lead didn’t either. I couldn’t understand what was different about the calls that went poorly. Then I started asking for two confidence ratings before the call: one for doing the job, one for interviewing.\nThat was the explanation. If they believed they could do the job, we could shape great answers no matter how low their interview confidence. But people who worried about the job were afraid to dig into their stories, so we couldn’t unearth the gems that I knew were there.\nI’m starting a series on behavioral interviews! Subscribe for free to receive new posts and support my work.\nSubscribe\nWas there anything I could do for less confident people? I brainstormed ideas with chatGPT, and that’s how I came up with the Wins Warmup, a quick exercise that became a beta-workshop hit.\nWins Warmup reminds people what they’re amazing at. Even if their current job isn’t a fit, there’s something they’d absolutely crush. Once that confidence clicks, the interview follows.\nWins Warmup\nPhoto by\nGabin Vallet\non\nUnsplash\nThere’s 2 steps to the wins warmup:\nJot down wins\nGet hyped up — for each win, have someone (friend, coach, AI) highlight the hidden PM skills\nJot down wins\nThink of 3 wins - times when something got better because of you. They can be big or small.  This could be a bug fix, a customer you delighted, a problem you solved, an approach you drove alignment on, a product launch. You can pick the first things that pop into your head, it’s just a warmup.\nGet hyped up\nFor each win, get hyped up and really bask in the skills, values, and competencies you showed. Have a friend or coach highlight the hidden career skills that contributed to the win. Or use this custom GPT,\nWins Warmup\n. You’ll find that even small accomplishments can illustrate several valuable competencies.\nExamples\nLet me show you how this works in practice.\nUnblocked delivery of an ML platform that doubled throughput\nThis shows a few different skills. You must have had strong technical skills. You’re showing the ability to overcome obstacles, which is really important for delivering excellent execution. I bet you’ll have lots of great nuggets to talk about if you use this as a story.\nCame up with a new feature idea that boosted conversion by 30%.\nThirty percent is a huge win. What will make this story powerful when you tell it is how you came up with the idea.  There’s a few ways that ideas like this can happen, and each shows off a different skill.\nOne way is that you were doing the work to watch people and you paid close attention to them. Then you dug in to really understand what was going on. That shows user focus. Another way is that you've been staying on top of technology and on top of new products which shows you're the subject matter expert on good product design.\nA lot of these ideas come from our past experience. They come from the years of experience that we've built up and the values that we've started to accumulate as we've done our job for a long time. There are principles that we start to build up and strategies that we start to put together. These things we’ve learned from our experience are core to what seniority means.\nWhen you came up with a great idea, we can elevate that to not just be a story about  “One time I came up with a good idea,” but rather, “You want to hire me because if you hire me, you get all of my years of experience and all of my seniority and all of my values and principles and strategic thinking.”\nLaunched a reporting system from scratch despite ambiguous requirements from managers who just wanted a static platform for all teams\nI love this example because it's really showing the contrast. The managers had one direction in mind, but you realized there was a better way. You dug in, looked at costs and benefits, and understood the needs of different teams. That’s showing autonomy and strategy. That contrast makes your story really strong.\nThe ambiguous requirements are also nice because dealing with tricky stakeholders and unclear requirements is a key skill. I bet that there’s something in the way you dug into those requirements that was really good — something that showed your skills, where someone less skilled might have thrown their hands up.\nRetained a strategic enterprise customer by building a custom GPT during a company-wide feature freeze; then landed 10 more customers.\nThis shows something I love seeing in senior candidates — flexing the processes.\nIt’s not that senior PMs ignore the formal process, but they have that higher level of judgment to know when it’s a good idea to push through, how to push through, and how to use their connections in the company to make things happen.\nThere are a lot of senior skills that go into work like that. And the connection to strategy—this was a strategic enterprise customer—you understood the company strategy and what was important.\nAnd, you did something that didn’t just help one customer, but helped ten. That’s the kind of skill a lot of B2B enterprise companies look for: someone who can balance solving one customer's need with building products that address a whole market.\nDug into regulatory & treasury topics to enable next-day payouts, differentiating us from competitors.\nWhen I think about subject matter expertise for product managers, this is really it. You don’t just show up and say, \"Okay, what exists?\" You're like, “Wait a second, I think there’s an opportunity here.”\nGetting into regulatory and treasury topics—not being afraid to do difficult, boring work to get the best results for customers, that’s a really nice demonstration of your values.\nThis also sounds like a story that might demonstrate North Star vision: instead of just make things incrementally better, can we figure out what the ideal situation would be and work backwards from there?\nReinvigorated a declining product category by using data to find profitable segments and aligning roadmap with marketing & merchandising\nThis is a really nice example of analytical skill — digging into numbers to identify the customer segment, not just relying on anecdotes.\nYou mention aligning the roadmap with marketing and merchandising. That could be surface-level, or it could be really deep. The details you use here can show how you've learned to do great product over time.\nThis story has an opportunity for you to teach me about merchandising, because I’ve never worked in merchandising before. So this has a chance to show off your expertise and your ability to communicate and teach someone something new.\nWhy it works\nInterviewers are trying to figure out if they can trust you to do the job. When you’re feeling really confident in yourself, the interviewer can feel it too. And on the flip side, if you’re not sure that you can do the job, they won’t be either.\nWhen you ground yourself in your skills and hype yourself up, you’re in a great mindset to answer questions about your experience.\nA question like “Tell me about a failure” stops feeling like a threat, and starts feeling like an opportunity to talk about a project that did not go the way you wanted and you were still able to turn it around, learn a lot, and use it as the basis for future wins.\nWhen you’re feeling confident, you’ll tell better stories and have more fun interviewing.\nGive it a try\nGo to\nWins Warmup\nand give it a try today.\nGot any other tricks for building up your confidence before an interview? Share it in the comments!\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n12\n2\nShare\nDiscussion about this post\nComments\nRestacks\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:20:01.036668"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/what-is-product-strategy",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "What is Product Strategy?\nThere are three pieces in a complete product strategy: Vision, Framework, Roadmap\nJackie Bavaro\nDec 10, 2022\n182\n7\n6\nShare\nHave you ever thought you had a strategy for your team, only to find out “That’s not a strategy”?\nI have.\nThe first time I had a plan, but it was all in my head. I knew my “strategy”, but no one else did.\nThe second time I wrote a strategy document with the detailed framework of what it would take to win, but teammates couldn’t visualize it. There was no emotional weight, no inspiration.\nBy the third time I thought I had it all figured out, but again I heard, “that’s not a strategy.” Hours of back-and-forth later we figured out the miscommunication: it was missing a roadmap.\nIt was around this time that I realize I’d never seen a formal definition of product strategy\n1\n. Product managers were expected to absorb a sense of what strategy was, and managers maintained “I’ll know it when I see it.”\nAs Head of Product Management, it was my job to coach & develop the PMs at Asana. I wanted a clearer definition so I could train the people on my team. I talked to other product leaders and researched how other people defined strategy.\nAn exciting pattern emerged. There were three common elements that appeared again and again. Some people cared about just one or two of them, but if you had all three you’d have something that counted as a product strategy for everyone.\nAnd that’s how the three-part product strategy framework was born.\nVision, Framework, Roadmap - The 3-Part Product Strategy Framework\nAt a high level, product strategy is your plan for how your product will win. The 3-part product strategy framework covers the Who, What, Where, When, Why, and How.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nDifferent people care about different elements, but if you build all three you’ll have a comprehensive strategy that works for everyone.\nThe Product Vision\nThe product vision is\nWHERE\nyou want to go. It’s an inspiring picture of the future. This is how you convince people to fund your product and join your team. When you share it publicly, it convinces customers to make a long-term bet on your product.\nA great product vision gets people excited.\nExample Vision\nFor an example of product vision, I love\nAsana’s 2018 vision video\n.\nIt starts by grounding in the amazing things people can do as a team. Then it highlights the problem: people spend more time on “work about work” than on real work—that’s absurd!\nIf you jump ahead to 4:36 in the video, JR introduces the vision: what if Asana was a company’s all-knowing logistical coordinator? Imagine a GPS for your organization where you plug in where you want to go and every team member gets optimal step-by-step directions on how to get there. That sounds exciting, but what does it mean?\nThe north star vision mocks & narrative show the details that make everything believable. JR walks through the day-in-the-life of a fictional research scientist, showing how Asana helps her focus. Then he zooms out to show how the team director can see what everyone is working on and hit a button to optimally allocate everyone on the team, even accounting for vacation schedules.\nI won’t narrate the whole video, but there’s intentional name-dropping of pain points that would resonate with potential customers (like forgetting to plan around vacation schedules) throughout the vision. It makes a team director think “oh yeah it’s ridiculous that my current software doesn’t do that, and it seems totally feasible.”\nYour vision doesn’t have to follow the narrative format. LinkedIn’s vision statement “Create economic opportunity for every member of the global workforce,\" is an inspiring picture of the future. If a short vision works to get people excited, you don’t need more.\nCreating a Vision\nIt took me a while to learn how to create a vision, because I don’t think of myself as an inspirational person. I get an “ick” feeling when it seems like someone is being too sales-y.\nThe trick I found for tapping into my genuine excitement is to draft the vision in the style of an infomercial.\nIf you’re not familiar with infomercials, they’re a type of TV commercial that tend to follow a set pattern. They start by dramatizing the problem, making the status quo feel unbearable (“Jars are sooo hard to open”). Then, they say “But there’s a better way…” before introducing the product and showing all the ways that happy people can use it (“Just press the button and you’ll have a complete dinner in minutes”). And, they often back it up with some description of their patented technology that makes it possible.\nHere’s a fun compilation:\nInfomercials are ridiculous, but they work.\nWhen I write a new product vision, I like to draft it as an infomercial. This framing gives me permission to go over-the-top. I don’t use the infomercial as the final version of the vision, but it helps me really tap into the emotional and inspirational side of myself.\nTo validate your vision you can show it to teammates, customers, and candidates. If they shrug or say “that sounds nice,” you’ve still got work to do. If they light up and say “Yes! I want that, how soon can I have it?” then you might be on the right track.\nFor more examples of vision, see\nAirBnB’s mobile vision\nand Gibson Biddle’s\nGLEe model\n.\nStrategic Framework\nThe strategic framework covers\nWHO\nyour customers are,\nHOW\nyou’re going to win them, and\nWHY\nyou’re making the strategic choices you make.\nThis is where you hash out the details of your team’s deep thinking. You’ll use it to drive the discussions that take your strategy from a quick draft to something great.\nA great framework tackles the important questions and identifies the most important risks, opportunities, and areas for validation. It gives teammates the context they need to make aligned decisions on their own.\nStrategic frameworks can take many formats, but they often include:\nTarget Market\n: Who’s our ideal customer? What products do they use (or how do they solve their problem) in the status quo?\nProduct Pillars, aka Strategic Themes\n: Which areas do we need to invest in to win? Why are these the important areas? What are some projects or tactics that fall under each pillar?\nStrategic Principles\n: How do we make decisions and handle trade-offs? What are our values? What do we believe about the space?\nExample Framework\nHere’s an abbreviated example from Asana’s early days:\nTarget Market\n: People who didn’t train to be project managers, but realized they need to do some project management to succeed at their job (eg. marketing managers). Their status quo is handling things over email.\nProduct Pillars, aka Strategic Themes\n: Our vision for Asana is to be the team brain that effortlessly coordinates work across people and teams. What does a good brain need? It needs to…\nKnow all the information about work:\nTasks, Projects, People, Teams, Subtasks, attached Documents\nDraw insightful connections\n: Calendar views, Reporting, Schedule suggestions\nAlways be with you\n: Mobile apps, Stability\nand also…\nLove\n: Humans aren’t robots. People need to love Asana (usability, delight) and feel loved when using the app (likes, task completion celebrations)\nStrategic Principles\n:\nFast is better than Features\nEasy to use AND Powerful\nFor more examples of strategic frameworks, see\nRoblox\n,\nTikTok\n,\nSalesforce\n,\nSlack\n,\nNetflix\n, and\nChegg\n.\nStrategic Roadmap\nThe strategic roadmap shows\nWHAT\nyou’ll build\nWHEN\n. It’s a timeline with checkpoints, working backwards from the vision.  This is not a commitment, instead it’s a wake-up call.\nWhen you first write down your roadmap, you’ll almost always see that at your current pace there’s no way you’ll achieve the vision in time. It can be the wake up call to realize you need to hire more people, or you need to really focus in on a narrower target market, or you need to take bigger swings at the bat.\nThe strategic roadmap is also an incredible tool for alignment. Stakeholders across the company will see the roadmap and say, “Wait, when are we working on internationalization?” or “We can’t go that long without a big marketing launch.” Maybe not the conversation you wanted to have, but it’s the conversation you need to have.\nA great strategic roadmap prioritizes the most important work to balance validating the product strategy with delivering results and working towards the vision.\nExample Roadmap\nHere’s a fake example of what a roadmap for DALL-E might look like. The work is grouped theme, and then slated for next quarter, next year, or after that. The themes should map to the strategic themes or product pillars from your strategic framework.\nFor details on how we built our roadmap at Asana, see\nthis blog post\n. For more example roadmaps, see the\nNetflix\n, and\nChegg\nstrategies.\nPulling it all together\nA cool thing about product strategies is that they can nest inside each other. The Head of Product can create a high-level product strategy. The directors then each create a strategy for their area. And then each PM creates a strategy for their own team.\nAny time you have a team that works together for multiple projects you can make a strategy.\nBefore you create a strategy, make sure you’ve spent a lot of time with your users. Watch usability sessions. Sit in on sales calls. Read support tickets. Look at usage data (especially individual session data if you have it). You can schedule your own strategic research sessions, but it’s also fine to use the customer touch points you already have in your day-to-day feature work.\nTo get started, block off a day or half a day on your calendar\n2\n. Then, work on whichever of the three parts calls to you. I've found that most people are naturally drawn to one of the three (for me it's strategic framework). Fill out whatever comes to your mind, even if it's wrong. Once you have a draft, you can use it to back-solve the other two parts.\nAs you work, write down the questions that surface. What data do you wish you had? What part of the company strategy do you need to understand better? Which trade-offs are really tough?\nThis alone time is really important, because we need to form our own opinions and become the expert on our product. We need the head-start so that we’ll be able to effectively facilitate the group strategy work. BUT, in many cases we don’t want to present our solo-strategy to the team.\nIt depends on your company and team culture, but in a lot of cases people will react badly to you handing them a strategy. That’s “your” strategy, and they won’t feel attached to it. Instead, you’ll want to put your draft strategy away, and come up with a plan to collaboratively craft the strategy. I’ve got an example of a process you can use in\nCracking the PM Career\nif you want a detailed step-by-step guide.\nCommunicate, Communicate, Communicate\nThe final thought I’ll leave you with is that you have to communicate your strategy WAY MORE than you think you do.\nYou’ve been immersed in your strategy, thinking about it all the time for days or weeks. Everyone else just dips into the strategy and then goes back to their job. They will forget it.\nYes, share your strategy at an all-hands. And also the business team all-hands. And your team all-hands. Put up posters. But also, work the strategy into your every day communication. Here are some examples:\n“That demo is really exciting! It helps us achieve <product pillar>.”\n“This design is a good start, but how does it address <strategic principle>?”\n“Good question. Because of <this part of the product strategy>, the answer should be…”\nIn closing\nI hope this article demystifies product strategy. Let me know if you have any questions!\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n1\nNotably, product strategy at tech companies don’t mean frameworks like the 4 C’s\n2\nIf this feels tough, imagine you had a friend getting married. You’d take a day off and your team would survive a day without you.\n182\n7\n6\nShare\nDiscussion about this post\nComments\nRestacks\nNandita Gokhale\nDec 14, 2022\nLiked by Jackie Bavaro\nThank for breaking down such a complex topic into 'easy to understand' components. this was very actionable for me and helped me move ahead with few components that I was stuck on for the last few weeks. Appreciate all the amazing content.\nExpand full comment\nReply\nShare\n1 reply by Jackie Bavaro\nNicolás\nDec 12, 2022\nLiked by Jackie Bavaro\nCommunicate, Communicate, Communicate. That's the main point of everything! If we're not capable to reach every person we need, strategy could be the best but at the end won't succeed\nExpand full comment\nReply\nShare\n5 more comments...\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:20:02.532344"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/hot-take-google-has-a-company-strategy",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Hot Take: Google has a company strategy, not a product strategy\nOr, Why Google keeps killing products\nJackie Bavaro\nDec 02, 2022\n86\n10\n2\nShare\nI was devastated when Google Reader shut down. I loved it as much as I love Microsoft Excel, and for the same reason: it gave me a superpower. With Reader, I could discover and stay on top of the latest information across the internet, no matter how frequently or infrequently a person posted.\nI’ve watched many beloved Google products get shut down: Wave, Inbox, My Maps, Stadia.\nThe list goes on and on\n. It’s gotten bad enough that people widely believe the shutdowns\ndamage Google’s brand\n.\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nSo why do they keep doing it?\nBecause Google has a company strategy, but they don’t make product strategies.\nGoogle’s Company Strategy\nBased on my time at Google, and everything I’ve seen since, Google’s company strategy is “Hire all the smart people.” Hire all the smart people and let them build. Hire all the smart people so they can’t work at a competitor. Hire all the smart people even if we don’t have something important for them to work on.\nGoogle acts like a venture capitalist, investing in promising people with the expectation that most will fail. They invest broadly in search of the idea that will deliver 100x. Let 1000 flowers bloom, and see which are the best.\nTo support this company strategy, Google makes it really,\nreally\neasy for anyone to start up a new project. The culture of “20% time” gives people permission to work on ideas outside of their primary role. There’s only the lightest of reviews needed to launch a “1% experiment.” Micro-kitchens and fun activities encourage the socializing that brings ad-hoc teams together.\nGoogle’s company strategy is closely tied to the lack of product strategy. To explain this, let me contrast with Microsoft.\nMicrosoft vs Google Product Strategy\nAt Microsoft, product leaders had a strong conviction of what it would take to succeed.\nSteven Sinofsky was the VP in charge of the Office division at the time I was there. He wrote long strategy documents about what we were building, why, and how. The VP below him then created a strategy document that filled in the details for the Office Server Group. And the GPM below him then wrote a strategy document for SharePoint. By the time you got down to me, I was responsible for delivering a very constrained slice of the product. Each piece fit into the larger puzzle.\nMy work was pre-approved. There was space for me to plan what my teams worked on, but each item needed to tie into a pillar of the broader Office strategy. Everything I wanted to build was reviewed during an“adds/cuts” meeting before it got started.\nWith all that up-front planning, the actual product decisions and working code were reviewed much less. Only the other PMs on my team reviewed my specs, and only me and the tester (also new grads usually) reviewed the working changes before they were added to the branch. For what it’s worth, I think this is why the quality of the details on Microsoft products is often lacking—a random PM made a decision and no one bothered to push back on it.\nContrast that with Google.\nAt Google, I never saw a strategy document. I went to every Friday all-hands, but I didn’t hear the leaders talk about a broad vision of what we needed to build. The people above me didn’t set direction and ask me to follow it.\nInstead, leaders encouraged teams to generate their own ideas. The founders had ideas of their top priorities and worked with the relevant teams on those, but the list of the top company OKRs was a subset of all the OKRs, not a roll-up. Some people were not working on anything the company cared about strategically!\nMicrosoft would have shut all those other projects down. Google let them have a chance. But just a chance.\nThese projects weren’t pre-approved. There was no guarantee that your work would launch. Google didn’t really care if they launched, even if your team had spent months on it. Each new feature, product, or change needed to prove itself.\nAs an APM, I loved this. I told candidates that Google was a much better environment than Microsoft for smart and ambitious people, because there was space to make your ideas happen. At Microsoft, everything was so top down. Leaders had already decided what we needed to build, so I’d felt like I was swimming upstream to get my ideas heard.\nIn retrospect, I don’t think my feelings matched reality. Yes, I’d felt like I was swimming upstream, but the big ideas I’d fought for (Firefox support, Wikis) actually launched. I cobbled them together whispering with engineers and relying on interns, but no one was mad when they found out. Google had the advantage that the culture supported pushing for new ideas, but at a cost.\nThe Cost of Google’s Company Strategy\nPhoto by\nFelix Mittermeier\non\nUnsplash\nGoogle’s company strategy works, but I think it comes at the expense of the employees and users. It especially comes at a cost to medium-scale products.\nAbout two years into my time at Google, two engineers from the Trondheim, Norway office came to meet me. They’d spent the last few months trying to improve a particular type of query popular in Norway. Now they wanted my help launching it.\nIt was immediately obvious to me that the idea was flawed. Their change didn’t make the search results better, and it unfairly promoted some sites over others. I checked with the engineering leadership and they agreed. Those engineers had been wasting their time.\nI tried to figure out who was the right person to deliver the bad news. I was shocked to learn that it was me. I’d never heard from those engineers or anyone on their team before. The project had been started and worked on (I think even A/B tested), without any input from the people who would ultimately need to approve their change. A few months later, the entire Norway office was shut down.\n…\nI was at Google when Google Plus started. Some APMs had convinced company leadership that we needed a Facebook competitor. The VP in charge of Google Plus hosted the Friday all-hands several times to get us all excited about what they were building. It was obvious to me and many others that there was no reason for people already on Facebook to switch from Facebook. Someone asked a direct question, but the VP deflected and talked about how easy it would be to group your friends with the Circles feature — which was not at all a reason to switch.\nIt seemed like Google didn’t have the processes or experience to get the product strategy right. “Who are our potential users and what does it take to win them?” is product strategy 101. Maybe someone raised this question in an exec review, but it didn’t become a launch blocker. Google+ never took off, and was eventually shut down.\nI think the lack of a product strategy is behind many of Google’s short-lived products. Projects like Google Wave, Google Inbox, or Stadia get the go-ahead without a deep, structured, well-reviewed plan for how they’re going to succeed and why they’re important. Some smart, ambitious person at the company spear-heads the project and pushes it through to launch. When the product isn’t a runaway success, Google cuts its losses and moves on to the next thing.\nIf Google didn’t start with a conviction that they needed the product, it makes sense that they wouldn’t have the stamina to keep iterating and investing. Most other companies don’t have the money to build and launch products with such little conviction and oversight. Other companies need their products to succeed, so they try harder & smarter to make the products successful.\nIn closing\nWhy do I care? Google Reader was around long enough to drive Bloglines out of business. Google Inbox was around long enough to drive Mailbox out of business. I miss those products.\nI usually avoid such pointed critiques, but I’m sharing my thoughts here because one of my key personal values is that I think people’s time and effort is precious.\nI was drawn to Asana because the world would be a better place if people spent less time on work-about-work and more time doing what they love.\nI care about product strategy because the world would be a better place if people spend less time on failed projects and more time working on things that make a difference.\nI hope that people who choose to work at Google can do so with their eyes open. I still think the company can be a wonderful place to work, but only if you’re okay with the risk that your product work might be wasted.\nI’m sure some of my memories and analysis here is wrong. I’d love you to share your corrections, disagreements, memories, and analysis in the comments!\nThanks for reading Cracking the PM Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n86\n10\n2\nShare\nDiscussion about this post\nComments\nRestacks\nKP\nDec 4, 2022\nLiked by Jackie Bavaro\nIME people often don’t realize that product strategies are actually way more important and influential than company strategies. Simply because it’s the products that have an impact on people’s lives, not the company. And this is not only true for users and customers, and society — it’s also true for the people who contribute to the creation and introduction of products which is basically everyone in the company. It’s the products we work on and use that connect us, not the company. It’s the products that are “strong centers” (Christopher Alexander) of our thinking and action, not the company.\nExpand full comment\nReply\nShare\nysamjo\nDec 5, 2022\nEdited\nLiked by Jackie Bavaro\nHaving a VC-like approach to your product porftolio is no company strategy - it's a certain method to create products but no standin for an overarching strategy.\nI would argue, if Google had such a astrategy, they could have succeeded with Google+. The strategy would have justified to leverage existing products instead of letting Google+ fight for itself without much support.\nhttps://medium.com/hyperlinked/give-me-one-year-product-ownership-of-google-contacts-and-i-make-google-social-622e84a01cdf\nExpand full comment\nReply\nShare\n8 more comments...\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:20:03.968314"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/the-charcuterie-framework-for-roadmap",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "The Charcuterie Framework for Roadmap Planning\nInstead of stack ranking your priorities, balance your investments across goals.\nJackie Bavaro\nNov 15, 2022\n29\n2\n2\nShare\nThe first time I planned Asana’s roadmap I stack ranked all of the things people wanted us to do, sorting by impact. We filled our quarter\n1\nwith building new features.\nThe second time, I did the same thing. The designers pushed back, saying it would be good ROI (return on investment) to iterate on the features we’d launched. So, I worked with engineering to estimate the cost of those improvements and re-sorted the list by impact/cost, but new features still ended up on top. Another roadmap building brand new features.\nThe third time, same result. None of the proposals to improve existing features made the cut. This time, the CEO pulled me aside and suggested that maybe something was wrong. I agreed, but what?\nI reached out to the head of product at other startups for advice. The startup ecosystem is surprisingly friendly, and people were willing to share how they planned their roadmaps. I learned that the best product leaders treated their product roadmap like a\nportfolio\nof investments. Instead of stack ranking work, they looked at their entire roadmap and made sure they were investing the right amount in the right things.\nI went back to our roadmap and looked at it from a portfolio perspective. Zero was clearly the wrong size investment in improving existing functionality. Twenty percent sounded better. And while I was thinking about it, ten percent improving tech debt made sense too. I chatted with the team and we felt good devoting the remaining 70% to new functionality. The new roadmap was a hit, and a designer mutiny was avoided.\nThis portfolio approach became my top piece of advice for PMs. But it was confusing because… what exactly is a portfolio? I tried to think of a more relatable analogy, and I guess I was hungry, because the Charcuterie Framework was born.\nThe Charcuterie Framework\nWhen you make a charcuterie board, you don’t stack rank all of your favorite foods and pick the top ten. If you did that, you might end up with ten types of salami and no cheese or fruit.\nInstead, you have a rough idea of how you want to balance your board, maybe 50% meat, 25% cheese, 25% fruit. And then you pick your favorites from within each category. You might even look at other types of balance: a few pricy items, not too much spicy stuff. You end up with a much better charcuterie board than if you’d tried to stack rank fruits against cheeses. That would be like trying to compare apples and oranges!\n2\nThanks for reading Jackie’s Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nThe same idea applies to product roadmaps.\nHere’s how you do it:\nFigure out your slices\nDetermine the balance\nPrioritize work within slices\nFigure out your slices\nFirst, you’ll pick which slices you want to look at, just like we looked at type (meat/cheese/fruit), spiciness, and price for our charcuterie.\nPrimary slices\nPrimary slices drive prioritization decisions (eg. “which projects would best help self-service customers?”). They provide a goal-oriented way of looking at potential projects. They often correspond to the way that product teams are organized.\nHere are some examples:\nGoals\n: eg. user growth, user retention, and revenue growth\nUser type\n: eg. enterprise sales customers vs. self-service customers, or advertisers vs. consumers.\nProduct Pillar\n: eg.\nRoblox’s\n: Rendering Fidelity, Identity, Building a Robust Economy, Building a Robust Economy, and Shared Fabric: Communication and Civility.\nSecondary slices\nThe secondary slices are additional lenses you can use to check if your roadmap is balanced, after you have a first draft.\nType of work\n: eg. new functionality, improving existing features, technical debt\nProduct\n: Do you have multiple products or platforms that you’ll need to invest in?\nRiskiness\n: eg. Core Biz, Related Projects,  Blue Sky Big Bets (\nGoogle’s 70/20/10 model)\nMarketing impact\n: Do you have enough newsworthy launches?\nDetermine the balance\nNext, for each slice consider how you want to balance your investment.\nDo you care about user growth and revenue equally? Maybe 80/20? How do the needs of enterprise sales compare in priority to self-service customers? 70/30? Write down your gut feeling.\nThe magical thing here is that when you talk about priority at this level, it’s remarkably easy to get everyone to agree. Everyone at Asana knew we shouldn’t invest zero in improving our existing functionality, and no one thought it should be more than half.\nThe rare occasions where there’s major disagreement, it’s usually because you’re dealing with an unresolved strategic question.\nAt Asana we once had to rewrite our entire codebase onto a new architecture in order to make the the site faster. We made the tricky strategic decision to invest 50% in the rewrite, and 50% in all other product work. Everyone wished we could ship product improvements faster, but we made the call that performance was more important.\nPrioritize work within slices\nNow that you’ve separated your apples from your oranges, you can compare within each group. What’s are the highest impact features for improving monetization? What about the most important technical debt investments?\nYou can even repeat the charcuterie framework within slices. What’s top priority for user growth? Maybe you’ll want to split it 50/50 between improving the onboarding experience and adding viral growth loops. The best way to improve onboarding? Maybe 70% improving usability and 30% in-product training. Charcuterie all the way down!\nIn closing\nPrioritizing is hard. When you find yourself stuck choosing between two options, zoom out and think about how you want to balance your investments overall.\nIf this post inspires you to make a charcuterie board, let me know! And ask any question in the comments below!\nThanks for reading Jackie’s Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n1\nTechnically an “\nepisode\n” which wasn’t exactly one quarter long.\n2\nI don’t know why I think this joke is so funny. I’m sorry.\n29\n2\n2\nShare\nDiscussion about this post\nComments\nRestacks\nAndrei\nDec 12, 2022\nThanks for sharing Jackie.\nVery interesting approach -- would we be able to share a few examples to help drive this home?\nI'm trying to replicate the framework, but having some issues with all the multiple slicing options.\nExpand full comment\nReply\nShare\nAndrei\nDec 12, 2022\nThanks for sharing Jackie.\nVery interesting approach -- would we be able to share a few examples to help drive this home?\nI'm trying to replicate the framework, but having some issues with all the multiple slicing options.\nExpand full comment\nReply\nShare\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:20:05.428535"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/the-3-stages-of-a-product-managers",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "The 3 Stages of a Product Manager's Career\nWhat's the difference between a Product Manager, Senior Product Manager, and a Director of Product?\nJackie Bavaro\nNov 10, 2022\n29\n3\nShare\nWhen I was a new PM, I had no idea what made more senior PMs different from me.\nI wrote specs, they wrote specs.\nI wrote 1-pagers on what we should build in the next release, they did too.\nEven the strategy documents that VPs sent out seemed like they were just specs for a broader scope (a product instead of a feature).\nAnd so, I assumed career growth was like one straight line. The career guides with their grids of skill by levels reinforced the idea that we all had the same job and skills, just at different levels of mastery. I thought I’d get better and better at shipping products until I was promoted to lead, GPM, VP, and eventually, CEO.\nThat’s a very misleading mental model. I was missing all of the other work those senior PMs and VPs did. Most of their work happened outside of the meetings I was invited too. When I was a manager at Asana, I realized that many of my reports had the same mistaken mental model.\nI wanted to make sense of what it really takes to succeed in product. Shreyas Doshi’s\nScope/Impact matrix\nreally resonated with me. As you advance in your career, you sometimes get better at your job, and sometimes expand your scope. Every time your scope increases you go back to being a beginner. You’re not as good at your new job, and you can feel it.\nBut, what did it mean to expand your scope? Was it just being put in charge of a larger team? As I looked into it, I realized that the differentiator wasn’t exactly the scope of the product you owned, but rather the brand new responsibilities (and accompanying expectations) that you pick up as you advance.  In fact, the entire definition of being “great” changes at each stage.\nThe entire definition of being “great” changes at each stage\nThere are three stages of a career in product.\nShipping Products\nThe first stage is shipping products. This is where the day-to-day product lifecycle work happens: Discover, Define, Design, Develop, Deliver, Debrief.\nIn this stage, a great PM ships products that delight customers and hit the business goals.\nAs an intern, APM, PM 1, and PM 2, this is probably your whole job. You’ll get better and better at shipping products. But, at some point you’ll start to plateau. Just getting better at product sense, analytical skills, and execution won’t get you to Senior PM. And that’s because at Senior PM, the job changes.\nProduct Strategy\nAt Senior PM, you pick up a new responsibility. Before, you were told what to work on. Now it’s your responsibility to identify\nnew\nopportunities and put together a plan for how to win them. You’ll still need to ship products that delight customers and hit the goals, but now you’ll be setting the goals.\nIn this stage, a great PM comes up with winning strategies that help their product succeed in the marketplace.\nAs a senior PM and PM lead, you’ll get better and better at product strategy. If you become a people manager, you might try to be the best boss for your reports. But, if you’re trying to make the leap to Director (especially Senior Director), you’ll find that the job changes again.\nOrganization Excellence\nIn the third stage, your job is to build a great team. It’s your responsibility to hire people, coach them, and set up processes so that your organization can create winning strategies and ship winning products at a scale\nbeyond\nwhat you could do as a single PM.\nAnd creating a strong organization below you is only half of the job. The other half is being a strategic advisor to the rest of the company. In this stage you sit in meetings with other executives. Sometimes you represent your organization, but other times you’re just there as another smart person who cares about the company. Your relationships and credibility with other company leaders are critical.\nIn this stage, a great product leader helps their company succeed by shipping successful products at scale and being a strong strategic advisor to the company as a whole.\nIn closing\nProduct Management isn’t just one job, it’s three. As an industry we haven’t been very clear about how much things change as you advance: both the role, and what success looks like.\nIf you want to advance in your career, it’s important to know what stage you’re in, and whether your next promotion is within the stage or across them.\nIf you’re looking to be promoted within a stage, it’s really about improving your craft. “Keep doing what you’re doing,” until you can do it faster, with fewer errors, with better results. Pay attention to peer feedback because it tends to accurately point at your areas of improvement.\nIf you’re looking to be promoted to the next stage, you need to be much more intentional. Often, you’ll feel like you’re doing a\nworse\njob at your current role when you start shifting to the new responsibilities. You might hand over some project management to the eng lead so that you can focus on strategy. You might upset one of your direct reports because you’re doing what’s right for the broader company. Work with your manager and manager’s peers to get the feedback that’s most important to get to the next stage.\nIf you want more details on what it takes to get promoted at each level,\nCracking the PM Career\nhas a full chapter on it with examples.\nThanks for reading Jackie’s Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n29\n3\nShare\nDiscussion about this post\nComments\nRestacks\nDavid Coyle\nNov 10, 2022\nLiked by Jackie Bavaro\nThanks Jackie! Always on point, needed a jolt here as I feel in between two of these jobs, just need to embrace where I am and keep learning and growing.\nExpand full comment\nReply\nShare\nSonal\nNov 27, 2022\nGreat article, Jackie! :) A lot of PMs would appreciate the work you've put into explaining the efficacies of the role.\nThe only piece of advise I'll like to put forward here is to use the right set of Project Management Tools to ensure goals are met. Most PMs aren't even aware of the tools that can help them stay organized, and before they realize, the projects goals and expectations get lost in translation. Having a clarity on who's doing what, when and who's work is dependent on whom is very important for a PM to deliver projects on time and keep climbing the ladder.\nExpand full comment\nReply\nShare\n1 reply\n1 more comment...\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:20:07.009968"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/use-pearl-instead-of-star-to-shine",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Use PEARL instead of STAR to shine in your PM interviews\nHighlight your seniority with the PEARL framework for talking about your experiences\nJackie Bavaro\nOct 23, 2022\n58\n5\n2\nShare\nWhen I was a hiring manager I was responsible not just for giving a hire/no-hire decision, but also for “leveling” the candidate. Leveling means making a decision about the person’s seniority level (and hence compensation level).\nI’d start with a guess based on their years and type of experience, previous title, and where they’d worked. But leveling product managers that way doesn’t always give an accurate answer. If someone has six years of marketing experience and two of PM, how much does that count for? What about four years in customer support and five in product? Is senior PM at Zynga the same as senior PM at Google? I needed a way to sort this out.\nThanks for reading Jackie’s Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\nA PM’s level is really about their\nscope, autonomy, and impact\n. And my favorite way to evaluate that is with the question “Tell me about a recent project you’re proud of.” I’ve found this to be a great way to understand how the PM has approached their job up to this point, and to probe for the potential to operate at higher levels.\nAt the junior end of the spectrum are PMs who have launched straightforward features. Someone else told the PM to build the feature, or it was the obvious thing to build. The PM was learning the ropes of product management—figuring out which stakeholders to loop in, how to buffer engineer estimates, catching usability issues. The PM makes choices, but those choices tend to have a right answer.\nThis is typically APM level.\nWith a little more experience, I meet PMs who figured out what their team should build. They’re assigned a team, do customer research and/or data analysis, and consider their product’s goals. There was an actual choice, with more than one option, and a reason for the direction they chose. At this level the PM starts to run into conflict, or at least pushback, because they are becoming the expert in their area and have a unique, useful perspective.\nThis is typically the PM 1 / PM 2 level.\nAt the senior end of the spectrum (for individual contributors), PMs have found new opportunities and done what it takes to go after them successfully. This means they’ve paid attention and spotted a customer problem or business opportunity that was being overlooked. They’ve advocated for investing in that area. They’ve convinced the leadership team to let them go after it, or found a clever way to test and launch. They drove the project forward and achieved successful results.\nThis is typically the Senior PM level.\nA counterintuitive thing about these levels is that the more your decisions were obviously correct, the lower your level.\nThe more your decisions were obviously right, the lower your level.\nThis might seem surprising—don’t more senior people make more correct decisions? Sure, in general… but when there’s a clear right and wrong answer, that’s the easy stuff. The hard stuff starts when you leave the land of “right” and “wrong” and enter the land of “it depends” and “oh I never thought of it like that.”\nSo, in order to highlight your seniority, you need to focus on why your decisions\nweren’t\nobvious. You need to build up all the reasons that smart people thought you should do something different… until you came along with new insights that convinced them.\nPEARL Framework\nEnter the PEARL framework—Problem, Epiphany, Action, Result, Learning. Use it instead of STAR (Situation, Task, Action, Result) to make sure your stories highlight your seniority.\nProblem\nProduct managers deal with problems. Customer problems. Business problems. Team problems. Sell us on the problems.\nBy framing this as a problem, you’re drawing the interviewer into the story and helping them understand why it’s important. You can start with the larger problem that your overall product is solving, and then get into the specific problem that you want to tell a story about.\nDraw a distinction between what you were handed and what problem you identified and prioritized. Did your boss hand you the fully formed project and you just executed? If so, this story isn’t going to make you look very senior.\nEpiphany\n(This probably should have been “insight”, but I couldn’t resist making it spell PEARL)\nI think the epiphany is the most important part of the story for product managers. We’re not drawing the designs or writing the code. We do some project management, but great\nproject\nmanagement isn’t really valued. Our insights are how we uniquely contribute to the team.\nShare the details of how you came to this epiphany. What’s the key thing you learned or realized that kicked off your action? Did it come from customer research, data analysis, or somewhere else? What did you see that other people were missing?\nMake sure to contrast your insights with the ‘obvious’ path. “Everyone thought we should do X, but based on Y, I realized we should actually do Z!” If you just did the obvious thing, anyone could have done it.\nAction\nThe action is the work you did to make it happen. Keep it short and focus on the things that you did that a PM with less experience wouldn’t have done as well. Instead of listing out every step of the process, pick out the hard or clever parts.\nGive your interviewer enough context to understand how challenging your role was. That said, be diplomatic when the challenge came from other people: badmouthing other people is a red flag and will trigger the interviewer to wonder if you were the problem.\nResult\nThe\nresult\nis the happy ending. PMs are supposed to be results-oriented, so make sure you don’t skip this.\nWhen you have good results, connect them to the larger goals, strategy, and mission. For example, instead of just talking about how people loved your feature, talk about how it improved retention.\nIt’s okay to have setbacks and failures in the story, but those should be the middle of the story. If you’re talking about a failed experiment, keep going and share how you iterated and had a successful launch later or how you used what you learned to avoid a similar problem at your next company.\nLearning\nEnding with what you learned gives you a chance to be leveled higher than how you performed in your story.\nEach of us grows with experience. How did that experience shape you? What will you take forward for next time? Did you get a chance to use that learning in a later project?\nAn example:\n(Problem) When I was working on the search team, we knew that we weren’t returning good local results for queries about local businesses like “pizza restaurants”.\n(Epiphany) I worked with the engineers and found that we had all the technical components we needed, but the leadership team didn’t trust the location information and didn’t want to risk returning irrelevant results. I knew I had to find a way to validate the location information, so I dug in to the data and realized something amazing! We could compare the location information on queries that had an obvious location, like “NYU bookstore” to see how accurate it was.\n(Action) I hand coded a few hundred queries and shared the results with the leadership team.\n(Result) They were convinced by my analysis and we were able to test and then launch. It was a huge success, as later measured by how many people used those local results and other global health metrics.\n(Learning) My big takeaways from this experience were how valuable it is to look at the data directly, and how important it is for products to do the right thing without any configuration.\nPractice with a friend\n“It sounds like you picked a vanity metric and then just built what your boss told you to even though it was a bad idea.”\nI was kind of terrified to give my friend this feedback, but I\nhad\ntold him I’d help him with a mock interview. Luckily he reacted well: “Woah that’s what it sounded like? That’s not what happened at all,” and he went on to explain more of what happened, how he’d taken initiative, and why his decisions were actually good. I was relieved. But also concerned. I’m not sure he would have gotten hired with the first version.\nThis is why I think it’s important to practice your stories with a friend who’s willing to put on the hat of someone who doesn’t want to hire you. Most companies ask a variety of “tell me about a time when…” questions, so you can prepare ahead of time.\nStart by thinking about the best stories that show off your seniority and impact. The ones you’re proud of. They should be recent, but not so recent that you don’t have results yet. Then round out your set of stories with ones that demonstrate a failure, a conflict, a challenge, collaboration and so on. If you can, pick negative stories from earlier in your career so it’s believable that you’ve improved.\nRun each story through the PEARL framework. Find the details that show off your seniority.\nGood luck!\nThanks for reading Jackie’s Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n58\n5\n2\nShare\nDiscussion about this post\nComments\nRestacks\nRam Kanumuri\nOct 23, 2022\nLiked by Jackie Bavaro\nThank you for sharing this, Jackie!\nI wish this came out a month ago. Would've surely addressed the feedback I got in an interview\nExpand full comment\nReply\nShare\nJosh\nNov 1, 2022\nThis is great! PEARL is so much better than STAR. Was hoping you'd write this when I heard you talk about it on Lenny's podcast!\nExpand full comment\nReply\nShare\n1 reply by Jackie Bavaro\n3 more comments...\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:20:08.189385"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/how-to-become-a-product-manager",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "How to become a product manager\nJackie Bavaro\nOct 07, 2022\n18\nShare\nExperienced PMs, I’m leading a 1-week workshop on product strategy, starting October 24th! Jump to the bottom for details.\nHow can I get my first product manager job?\nI’m excited to start off this newsletter with such a common and important question. There are 8 (eight!) paths into product management that I know of. If you find another path, please tell me!\nAnd for all of these paths,\nCracking the PM Interview\n&\nCracking the PM Career\ncan help you get the job once you get the interview.\nAssociate Product Manager\nIf you’re currently an undergraduate in university, this is a straightforward, but competitive path. You’ll need multiple signs of excellence to stand out.\nHere are some examples:\nMajor or minor in Computer Science (a requirement for some APM roles)\nDouble major or minor in a field like Economics, Business, Psychology, Design or Cognitive Science\nStarting an entrepreneurial side project or business\nLeadership roles such as Residential Advisor (RA), Teaching Assistant (TA), varsity sports, or club president\nAttending a top school\nAchieving a High GPA\nA referral from someone who works at the company\nThis video has more information for undergraduates, including my hot take on  parliamentary debate:\nInternal Transfer\nThe most common way people transition into product management is with an internal transfer. You get to lean on your existing credibility, relationships, and product knowledge.\nHere’s how:\nTake on PM-like tasks alongside your current work\n. If your team has a PM, ask them what you can do to help. You can pitch new features or help the team with prioritization. Look for internal projects that need some product help–they’re often understaffed.\nTalk to the PM hiring manager\n. Let them know that you’re interested in product management, and ask if they have any advice or opportunities for you. They can help you focus in on what skills you should be developing. They might even let you sit in on some PM meetings if you’re lucky!\nAsk for the title change\n. If you’re already doing the PM job, ask your manager if you can change your title to product manager.\nGet advice from coworkers who have made the move.\nInternal transfer processes differ by company, so make sure to learn how they work at yours. Be especially careful if your manager might hold a grudge and try to block your transfer.\nAs you take this path, be warned that it probably requires taking on extra work in addition to doing a great job at your current role.\nFrom a well-known tech company to a smaller company\nIt can be really hard to get an internal transfer at the top tech companies (especially Google). Luckily, if you have another job at those companies, you can sometimes be hired directly as a product manager at a smaller company who values your experience.\nTry to absorb your company’s product best practices:\nIf it’s an option, move to a role where you can work closely with product managers.\nLearn your company’s product process. How does an idea become a launched feature? What documents or prototypes are created? What are the reviews or checkpoints?\nAttend meetings with PMs, especially product reviews and product teardowns.\nRead the documents and email that PMs send. Are there templates or common patterns they use?\nAsk a friendly PM if they’d help you develop your PM skills. Let them know you’re interested in becoming a PM and see if they’ll talk to you about their work.\nThen, look for a company appreciates your knowledge.\nMBA\nYou don’t need an MBA to become a product manager, but it can help. If you’re having trouble getting PM jobs at the caliber you want, an MBA from a great school can open doors for you. In addition to the career fairs, alumni networks can help you discover job opportunities at any stage of your career.\nAs a hiring manager, I’ve tended to have a slight bias against MBA candidates, especially within the first two years of graduation. I’ll tell you why so you can hopefully avoid the pitfalls:\nLack of a learning mindset\n: Many MBA candidates talk like they know it all. They feel like they’ve learned the right way to do things, and it doesn’t seem to occur to them that the real world is more complex. This makes it hard to have a collaborative conversation.\nOver-reliance on framework\ns: I’ve seen people try to solve problems by applying an existing framework, while missing the deeper point of what’s actually going on. Some stop trying to answer an interview question if it doesn’t fit one of their frameworks.\nDistaste for the day-to-day PM work:\nSome people with MBA’s seem to think of product management as just a stepping stone on the way to people management. I have nothing against ambition, but I hire a PM because I need a good PM. I want to manage someone who wants to be good at the job.\nPursuing business school can be expensive and time-consuming, but many people have found it to be a good path into product management.\nSpecialized expertise\nIf you have important industry experience, you can sometimes leverage that to get a PM job. Look for a company that values your experience.\nHere are some examples:\nFrom doctor to health startup PM\nFrom lawyer to PM at a company that happens to be founded by a lawyer\nFrom teacher to educational technology PM\nA benefit of this path is that you don’t always have to start as an entry level PM.\nNetworking and Friendships\nMost companies are reluctant to hire someone without PM experience. However, if you’ve build up relationships and credibility with someone, they’ll sometimes hire you to their company. This approach works best for small startups, although at any size company it’s helpful to have someone internal submit your resume.\nCold outreach\nThis is a very tricky path, but some people make it work. It can be a reasonable approach if you’re a power user of a product that doesn’t have a PM. You’ll need to find the hiring manager, figure out the best way to contact them, and have a compelling enough message that they’ll be willing to meet you.\nThis is one case where it can be helpful to write up your own analysis of the product and your ideas for improvement. If it’s good enough, you might convince them to hire you! In most other cases I don’t recommend sharing your own product ideas unprompted, because without all the internal context your ideas are usually obvious and low-impact compared with what the team is thinking.\nFounder of acquired startup\nFor completeness I’m including this path, but I don’t recommend starting a company with the hopes of it being acquired and you becoming a PM. Starting a company is hard! That said, many great PMs started this way. When a company is acquired they need to find a spot for the founders, and PM is often a natural fit. Facebook is well known for having many ex-founder PMs.\nIn closing\nThere are many paths to become a PM:\nAssociate Product Manager\nInternal Transfer\nFrom a well-known tech company to a smaller company\nMBA\nSpecialized Expertise\nNetworking and Friendships\nCold Outreach\nFounder of acquired startup\nSome people find a quick route into product management, while for others it takes several years. I hope this guide helps you find the best approach for you!\nProduct Strategy Workshop\nStarting October 24th I’ll be leading a product strategy workshop:\nCracking the Product Strategy\n.\nCome join if you'd like to learn how to move from delivering a list of features to creating a product strategy that inspires your team and helps your product succeed.\nWe'll cover discovering your strategy (how to go from your user insights to strategic insights), drafting your strategy (Vision, Framework, Roadmap), and driving strategic alignment (draw out people's best ideas and get them onboard).\nJoin here:\nhttps://maven.com/jackie-bavaro/cracking-the-product-strategy\nand you can use promo code 35OFF for a 35% discount.\nIf the course seems like a great match but the price point doesn't work for you,\napply for a scholarship\n.\nThanks for reading Jackie’s Newsletter! Subscribe for free to receive new posts and support my work.\nSubscribe\n18\nShare\nDiscussion about this post\nComments\nRestacks\nTop\nLatest\nDiscussions\nNo posts\nReady for more?\nSubscribe",
    "scraped_at": "2025-11-13T12:20:09.637663"
  },
  {
    "url": "https://jackiebavaro.substack.com/p/coming-soon",
    "title": "Cracking the PM Newsletter",
    "date": "No date",
    "content": "Everything Product Management\nJackie Bavaro\nDec 16, 2020\n2\nShare\nWelcome to Cracking the PM Newsletter by me, Jackie Bavaro. Co-Author of Cracking the PM Interview and Cracking the PM Career. Previously @ Asana, Google & Microsoft.\nSign up now so you don’t miss the first issue.\nSubscribe\nIn the meantime,\ntell your friends\n!\n2\nShare",
    "scraped_at": "2025-11-13T12:20:10.968812"
  }
]